function 反应堆(unit) {
  return () => `<反应堆>生产${unit}`
}

function 科技实验室(req, unit, count) {
  return g => `每回合结束时，若拥有至少${req}<科技挂件>，则获得${count(g)}${unit}`
}

function 快速生产(unit, count) {
  return g => `<快速生产>：获得${count(g)}${unit}`
}

export default [
  {
    name: '死神火车',
    race: 'T',
    level: 1,
    unit: {
      收割者: 3,
      恶火: 2,
      $反应堆: 1
    },
    desc: [
      g => `<任务>：让${g ? 2 : 1}张卡牌<进场>\n奖励：获得${g ? 2 : 1}晶体矿`
    ],
    remark: '虽然未三连的该卡牌提示需要进场1张卡牌，但是任务计数是2，这是因为需要绕过此卡牌进场本身\n由于三连不额外触发进场本身，所以任务计数也是2。'
  },
  {
    name: '好兄弟',
    race: 'T',
    level: 1,
    unit: {
      陆战队员: 6,
      $反应堆: 1
    },
    desc: [
      快速生产('陆战队员', g => g ? 6 : 4),
      反应堆('陆战队员')
    ]
  },
  {
    name: '挖宝奇兵',
    race: 'T',
    level: 2,
    attr: {
      gold: true
    },
    unit: {
      响尾蛇战车: 3,
      $反应堆: 1
    },
    desc: [
      () => `<任务>：刷新5次\n奖励：<发现>1张等同于你当前酒馆星级的卡牌`
    ]
  },
  {
    name: '实验室安保',
    race: 'T',
    level: 2,
    unit: {
      陆战队员: 6,
      医疗兵: 3,
      $反应堆: 1
    },
    desc: [
      反应堆('陆战队员'),
      () => `<进场>时，相邻两侧人族卡牌的<挂件>类型改变`
    ]
  },
  {
    name: '征兵令',
    race: 'T',
    level: 2,
    attr: {
      insert: true
    },
    unit: {
      '陆战队员(精英)': 4,
      陆战队员: 3,
      $反应堆: 1
    },
    desc: [
      () => `<进场>时，抽取两侧人族卡牌三分之二的单位`
    ]
  },
  {
    name: '恶火小队',
    race: 'T',
    level: 2,
    unit: {
      恶火: 6,
      $反应堆: 1
    },
    desc: [
      快速生产('攻城坦克', () => 1),
      反应堆('恶火'),
      科技实验室(2, '歌利亚', g => g ? 2 : 1)
    ]
  },
  {
    name: '空投地雷',
    race: 'T',
    level: 3,
    unit: {
      寡妇雷: 3,
      $反应堆: 1
    },
    desc: [
      g => `任意卡牌<进场>时，获得${g ? 2 : 1}寡妇雷`,
      快速生产('寡妇雷', g => g ? 3 : 2)
    ]
  },
  {
    name: '步兵连队',
    race: 'T',
    level: 3,
    unit: {
      陆战队员: 5,
      医疗运输机: 2,
      劫掠者: 3,
      $反应堆: 1
    },
    desc: [
      快速生产('劫掠者', g => g ? 5 : 3),
      反应堆('劫掠者')
    ]
  },
  {
    name: '飙车流',
    race: 'T',
    level: 3,
    unit: {
      秃鹫: 4,
      飓风: 3,
      $科技实验室: 1
    },
    desc: [
      快速生产('秃鹫', g => g ? 5 : 3),
      () => '<任务>：让3张人族卡牌<进场>\n奖励：相邻左侧人族卡牌的<挂件>类型变为<高级科技实验室>'
    ]
  },
  {
    name: '科考小队',
    race: 'T',
    level: 3,
    attr: {
      insert: true
    },
    unit: {
      歌利亚: 4,
      铁鸦: 2,
      $科技实验室: 1
    },
    desc: [
      () => `<进场>时，相邻两侧人族卡牌的<挂件>类型改变`,
      g => `<任务>：刷新2次\n奖励：获得${g ? 2 : 1}歌利亚\n每回合结束时，重置任务`
    ],
  },
  {
    name: '陆军学院',
    race: 'T',
    level: 4,
    unit: {
      战狼: 3,
      维京战机: 2,
      $科技实验室: 1
    },
    desc: [
      快速生产('维京战机', g => g ? 5 : 3),
      科技实验室(3, '战狼', g => g ? 2 : 1)
    ]
  },
  {
    name: '空军学院',
    race: 'T',
    level: 4,
    unit: {
      解放者: 3,
      $科技实验室: 1
    },
    desc: [
      快速生产('维京战机', g => g ? 5 : 3),
      g => `任意<任务>完成时，获得${g ? 2 : 1}解放者`
    ]
  },
  {
    name: '交叉火力',
    race: 'T',
    level: 4,
    unit: {
      攻城坦克: 2,
      歌利亚: 3,
      $科技实验室: 1
    },
    desc: [
      快速生产('歌利亚', g => g ? 5 : 3),
      科技实验室(5, '攻城坦克', g => g ? 2 : 1)
    ]
  },
  {
    name: '枪兵坦克',
    race: 'T',
    level: 4,
    unit: {
      陆战队员: 8,
      攻城坦克: 2,
      $反应堆: 1
    },
    desc: [
      g => `每回合结束时，所有具有<反应堆>的人族卡牌获得${g ? 4 : 2}陆战队员`
    ]
  },
  {
    name: '斯台特曼',
    race: 'T',
    level: 4,
    attr: {
      insert: true
    },
    unit: {
      斯台特曼: 1,
      思旺: 1,
      $高级科技实验室: 1
    },
    desc: [
      g => `<快速生产>：相邻两侧卡牌将${g ? 2 : 1}歌利亚和${g ? 2 : 1}维京战机<精英化>`,
      () => '<进场>时，相邻左侧人族卡牌的<挂件>类型变为<高级科技实验室>'
    ]
  },
  {
    name: '护航中队',
    race: 'T',
    level: 5,
    unit: {
      怨灵战机: 3,
      黄昏之翼: 1,
      $科技实验室: 1
    },
    desc: [
      快速生产('黄昏之翼', g => g ? 2 : 1),
      g => `任意卡牌<进场>时，获得${g ? 2 : 1}怨灵战机`
    ]
  },
  {
    name: '泰凯斯',
    race: 'T',
    level: 5,
    unit: {
      泰凯斯: 1,
      '陆战队员(精英)': 6,
      $反应堆: 1,
      医疗运输机: 2
    },
    desc: [
      反应堆('陆战队员(精英)'),
      g => `每回合结束时，将所有人族卡牌的各${g ? 5 : 3}陆战队员和${g ? 5 : 3}劫掠者<精英化>`,
      g => `每回合结束时，获得${g ? 2 : 1}医疗运输机`
    ],
    remark: '游戏内原文为 变为<精英单位> ，此处修正为通用用语'
  },
  {
    name: '外籍军团',
    race: 'T',
    level: 5,
    attr: {
      insert: true
    },
    unit: {
      牛头人陆战队员: 2,
      鱼人陆战队员: 1,
      $反应堆: 1
    },
    desc: [
      反应堆('牛头人陆战队员'),
      () => '<进场>时，相邻两侧卡牌将每6个陆战队员变为1牛头人陆战队员(精英则只需要3个)'
    ]
  },
  {
    name: '钢铁洪流',
    race: 'T',
    level: 5,
    unit: {
      雷神: 3,
      战狼: 2,
      $科技实验室: '1'
    },
    desc: [
      快速生产('雷神', g => g ? 2 : 1),
      g => `每回合结束时，若拥有5<科技挂件>，则所有卡牌将${g ? 2 : 1}攻城坦克和${g ? 2 : 1}战狼<精英化>`
    ]
  },
  {
    name: '游骑兵',
    race: 'T',
    level: 6,
    unit: {
      '雷诺(指挥官)': 1,
      $反应堆: 1
    },
    desc: [
      g => `任意卡牌<挂件>变更时，相应卡牌获得${g ? 2 : 1}雷诺(狙击手)`,
      反应堆('雷诺(狙击手)')
    ]
  },
  {
    name: '沃菲尔德',
    race: 'T',
    level: 6,
    unit: {
      沃菲尔德将军: 1,
      帝盾卫兵: 3,
      $科技实验室: 1
    },
    desc: [
      g => `每回合结束时，所有卡牌将${g ? 2 : 1}陆战队员(精英)变为帝盾卫兵`,
      g => `<唯一>：获得每回合<出售>的${g ? '前两张' : '第一张'}人族卡牌的单位`
    ]
  },
  {
    name: '帝国舰队',
    race: 'T',
    level: 6,
    unit: {
      战列巡航舰: 4,
      $科技实验室: 1
    },
    desc: [
      g => `<任务>：<出售>3张卡牌\n奖励：获得${g ? 2 : 1}战列巡航舰并重置此任务`,
      科技实验室(4, '黄昏之翼', g => g ? 4 : 2)
    ]
  }
]
