export default {
  定点部署: {
    s: '<进场>时，可以指定部署位置',
    c: '卡牌进场时可以选择部署位置，若位置上已有卡牌：\n若选择的位置右侧有空位，将选择位置的卡牌及其右侧连续的若干张卡牌右移1格，否则将选择位置的卡牌及其左侧连续的若干张卡牌左移1格，最后部署卡牌。'
  },
  进场: {
    s: '卡牌从商店或暂存区置入场内'
  },
  出售: {
    s: '<进场>后的卡牌出售'
  },
  唯一: {
    s: '若多张卡牌具有该效果，仅最左侧起效'
  },
  金色卡牌: {
    s: '<三连>后的卡牌',
    c: '部分特殊效果能使卡牌变为金色，如<:黄金矿工>'
  },
  无法三连: {
    s: '无法<三连>，视为<金色卡牌>'
  },
  三连升级: {
    s: '<反甲>，<重构光束>，<狙击镜>，<金光闪闪>，<力大砖飞>'
  },
  三连: {
    s: '将新卡牌与场上最左侧2张非<金色卡牌>的该名称卡牌合并至左侧的卡牌，改为金色卡牌，<发现>1张等同于你当前酒馆星级+1的卡牌或1个<三连升级>，触发卡牌的进场效果'
  },
  发现: {
    s: '对于卡牌：从3张卡牌中选择一张置入暂存区，暂存区满则直接<进场>'
  },
  精英化: {
    s: '将存在对应<精英单位>的单位变为对应<精英单位>'
  }
}