function 注卵(unit, count) {
  return g => `出售时，<注卵>${count(g)}${unit}`
}

function 孵化(unit, count, type = '每回合结束') {
  return g => `${type}时，<孵化>${count(g)}${unit}`
}

export default [
  {
    name: '虫群先锋',
    race: 'Z',
    level: 1,
    unit: {
      跳虫: 8,
      爆虫: 3,
    },
    desc: [
      g => `每回合结束时，获得${g ? 4 : 2}跳虫`
    ]
  },
  {
    name: '蟑螂小队',
    race: 'Z',
    level: 1,
    unit: {
      蟑螂: 3,
      爆虫: 1
    },
    desc: [
      g => `每回合开始时，将${g ? 2 : 1}蟑螂变为破坏者`,
      注卵('蟑螂', g => g ? 4 : 2)
    ]
  },
  {
    name: '屠猎者',
    race: 'Z',
    level: 2,
    unit: {
      跳虫: 10,
      刺蛇: 2
    },
    desc: [
      () => '每回合结束时，将所有刺蛇变为刺蛇(精英)',
      g => `提升酒馆等级时，获得${g ? 2 : 1}刺蛇(精英)`
    ]
  },
  {
    name: '埋地刺蛇',
    race: 'Z',
    level: 2,
    attr: {
      insert: true
    },
    unit: {
      刺蛇: 6
    },
    desc: [
      注卵('刺蛇', g => g ? 6 : 3)
    ]
  },
  {
    name: '变异军团',
    race: 'Z',
    level: 2,
    unit: {
      被感染的陆战队员: 7
    },
    desc: [
      g => `任意卡牌<注卵>时，获得${g ? 2 : 1}被感染的陆战队员`
    ]
  },
  {
    name: '孵化蟑螂',
    race: 'Z',
    level: 2,
    unit: {
      蟑螂: 4,
      破坏者: 2
    },
    desc: [
      孵化('蟑螂', g => g ? 2 : 1)
    ]
  },
  {
    name: '爆虫滚滚',
    race: 'Z',
    level: 3,
    unit: {
      爆虫: 10
    },
    desc: [
      g => `每回合结束时，每有${g ? 15 : 20}爆虫<孵化>1爆虫`,
      () => `<唯一>：获得任意<出售>卡牌中的跳虫，并将其变为爆虫`
    ],
    remark: '每回合只<孵化>1次\n跳虫(精英)将变为爆虫(精英)'
  },
  {
    name: '飞龙骑脸',
    race: 'Z',
    level: 3,
    attr: {
      insert: true
    },
    unit: {
      跳虫: 15,
      异龙: 5
    },
    desc: [
      孵化('异龙', g => g ? 4 : 2, '<出售>')
    ]
  },
  {
    name: '凶残巨兽',
    race: 'Z',
    level: 3,
    unit: {
      雷兽: 2
    },
    desc: [
      注卵('雷兽', g => g ? 4 : 2)
    ]
  },
  {
    name: '注卵虫后',
    race: 'Z',
    level: 3,
    unit: {
      虫后: 5
    },
    desc: [
      g => `每回合开始时，<注卵>${g ? 2 : 1}蟑螂和${g ? 2 : 1}刺蛇`
    ]
  },
  {
    name: '孵化所',
    race: 'Z',
    level: 4,
    attr: {
      insert: true
    },
    unit: {
      菌毯肿瘤: 1,
      虫后: 2,
      守卫: 2
    },
    desc: [
      g => `<唯一>：任意卡牌<孵化>单位至此卡牌时，额外<孵化>${g ? 3 : 2}单位`
    ],
    remark: '额外<孵化>的单位是最后被<注卵>的单位'
  },
  {
    name: '地底伏击',
    race: 'Z',
    level: 4,
    attr: {
      insert: true
    },
    unit: {
      潜伏者: 3
    },
    desc: [
      孵化('潜伏者', g => g ? 2 : 1, '<进场>')
    ]
  },
  {
    name: '孵化刺蛇',
    race: 'Z',
    level: 4,
    unit: {
      蟑螂: 4,
      '刺蛇(精英)': 3
    },
    desc: [
      孵化('刺蛇(精英)', g => g ? 2 : 1)
    ]
  },
  {
    name: '感染深渊',
    race: 'Z',
    level: 4,
    unit: {
      感染者: 2,
      陆战队员: 3
    },
    desc: [
      g => `每回合结束时，所有卡牌将${g ? 4 : 2}陆战队员变为被感染的陆战队员，并将他们<注卵>`,
      g => `每回合开始时，所有卡牌将${g ? 2 : 1}被感染的陆战队员变为畸变体`
    ],
    remark: '不能注卵陆战队员(精英)'
  },
  {
    name: '腐化大龙',
    race: 'Z',
    level: 5,
    unit: {
      腐化者: 6
    },
    desc: [
      g => `每回合结束时，将${g ? 4 : 2}腐化者变为巢虫领主`,
      注卵('巢虫领主', g => g ? 4 : 2)
    ]
  },
  {
    name: '空中管制',
    race: 'Z',
    level: 5,
    attr: {
      insert: true
    },
    unit: {
      '异龙(精英)': 4,
      飞蛇: 1
    },
    desc: [
      孵化('爆蚊', g => g ? 6 : 3, '<进场>'),
      孵化('异龙(精英)', g => g ? 2 : 1)
    ]
  },
  {
    name: '虫群大军',
    race: 'Z',
    level: 5,
    unit: {
      雷兽: 2,
      刺蛇: 8
    },
    desc: [
      g => `每回合结束时，若拥有至少4张虫族卡牌，则<注卵>${g ? 2 : 1}雷兽`
    ]
  },
  {
    name: '终极进化',
    race: 'Z',
    level: 5,
    attr: {
      insert: true
    },
    unit: {
      莽兽: 2
    },
    desc: [
      g => `<进场>时，相邻两侧卡牌将${g ? 2 : 1}蟑螂变为莽兽`
    ]
  },
  {
    name: '凶猛巨兽',
    race: 'Z',
    level: 6,
    unit: {
      利维坦: 1
    },
    desc: [
      g => `<进场>时，所有虫族卡牌获得${g ? 4 : 2}腐化者`,
      g => `每回合结束时，相邻两侧虫族卡牌获得${g ? 4 : 2}守卫`
    ]
  },
  {
    name: '扎加拉',
    race: 'Z',
    level: 6,
    unit: {
      扎加拉: 1
    },
    desc: [
      g => `<唯一>：任意卡牌进行<孵化>时，单位额外<孵化>到此卡牌，并且此卡牌获得1${g ? '巢虫领主' : '异龙'}`
    ],
    remark: '绝对的虫族核心'
  },
  {
    name: '斯图科夫',
    race: 'Z',
    level: 6,
    unit: {
      斯图科夫: 1
    },
    desc: [
      g => `<唯一>：${g ? '任意' : '偶数次'}六星以下的非虫族卡牌<进场>时，将其中的非英雄单位<注卵>到最左侧的<虫卵>牌`
    ]
  }
]