export default {
  "card": [
    {
      "name": "英雄叉",
      "race": "P",
      "unit": {
        "卡尔达利斯": 1,
        "水晶塔": 2
      },
      "desc": [
        [
          "折跃单位到此卡牌时, 将所有折跃的狂热者(精英)变为卡尔达利斯",
          "折跃单位到此卡牌时, 将所有折跃的狂热者(精英)变为卡尔达利斯"
        ]
      ],
      "type": "card",
      "pack": "军备竞赛",
      "pool": true,
      "level": 2
    },
    {
      "name": "机械感染",
      "attr": {
        "gold": true
      },
      "race": "Z",
      "unit": {
        "被感染的女妖": 6
      },
      "desc": [
        [
          "每回合开始时, 若雷兽数量≥4, 则获得1末日巨兽并抹除卡牌描述",
          "每回合开始时, 若雷兽数量≥4, 则获得1末日巨兽并抹除卡牌描述"
        ],
        [
          "每回合结束时, 孵化1被感染的女妖",
          "每回合结束时, 孵化1被感染的女妖"
        ]
      ],
      "type": "card",
      "pack": "军备竞赛",
      "pool": true,
      "level": 3
    },
    {
      "name": "黑色行动",
      "race": "T",
      "unit": {
        "恶蝠游骑兵": 2,
        "反应堆": 1
      },
      "desc": [
        [
          "快速生产: 获得<1>恶蝠游骑兵",
          "快速生产: 获得<2>恶蝠游骑兵"
        ],
        [
          "反应堆生产修理无人机",
          "反应堆生产修理无人机"
        ],
        [
          "每回合结束时, 此卡牌将所有陆战队员精英化",
          "每回合结束时, 此卡牌将所有陆战队员精英化"
        ]
      ],
      "type": "card",
      "pack": "军备竞赛",
      "pool": true,
      "level": 4
    },
    {
      "name": "死亡之握",
      "attr": {
        "void": true
      },
      "race": "N",
      "unit": {
        "死亡之握水晶": 1
      },
      "desc": [
        [
          "唯一: 每回合结束时, 获得每张当前未购买卡牌中的<1>非英雄单位",
          "唯一: 每回合结束时, 获得每张当前未购买卡牌中的<2>非英雄单位"
        ],
        [
          "唯一: 刷新时, 复制此卡牌<1>非英雄单位",
          "唯一: 刷新时, 复制此卡牌<2>非英雄单位"
        ]
      ],
      "rmrk": "原文的刷新描述没有唯一, 此处根据实际效果添加该标签, 可能是一个bug",
      "type": "card",
      "pack": "军备竞赛",
      "pool": true,
      "level": 6
    },
    {
      "name": "黄昏之翼",
      "race": "T",
      "unit": {
        "黄昏之翼": 2,
        "女妖": 1,
        "反应堆": 1
      },
      "desc": [
        [
          "快速生产: 获得<1>黄昏之翼",
          "快速生产: 获得<2>黄昏之翼"
        ],
        [
          "反应堆生产女妖",
          "反应堆生产女妖"
        ]
      ],
      "type": "card",
      "pack": "天空之怒",
      "pool": true,
      "level": 3
    },
    {
      "name": "守卫巢穴",
      "race": "Z",
      "unit": {
        "守卫": 2,
        "异龙": 4
      },
      "desc": [
        [
          "每回合结束时, 注卵<1>守卫, 并将所有卡牌的各<1>异龙变为守卫",
          "每回合结束时, 注卵<2>守卫, 并将所有卡牌的各<2>异龙变为守卫"
        ]
      ],
      "type": "card",
      "pack": "天空之怒",
      "pool": true,
      "level": 4
    },
    {
      "name": "净化之光",
      "race": "P",
      "unit": {
        "虚空辉光舰(精英)": 2,
        "水晶塔": 1
      },
      "desc": [
        [
          "每回合结束时, 获得<1>虚空辉光舰",
          "每回合结束时, 获得<2>虚空辉光舰"
        ],
        [
          "集结(4): 所有卡牌将<1>虚空辉光舰精英化",
          "集结(4): 所有卡牌将<2>虚空辉光舰精英化"
        ]
      ],
      "type": "card",
      "pack": "天空之怒",
      "pool": true,
      "level": 5
    },
    {
      "name": "死亡舰队",
      "attr": {
        "dark": true
      },
      "race": "N",
      "unit": {
        "塔达林母舰": 1,
        "毁灭者": 2
      },
      "desc": [
        [
          "获得黑暗值时, 获得<1>毁灭者",
          "获得黑暗值时, 获得<2>毁灭者"
        ],
        [
          "10黑暗值时单位复活1次",
          "10黑暗值时单位复活1次"
        ]
      ],
      "type": "card",
      "pack": "天空之怒",
      "pool": true,
      "level": 6
    },
    {
      "name": "艾尔游骑兵",
      "race": "T",
      "unit": {
        "陆战队员(精英)": 3,
        "秃鹫": 1,
        "科技实验室": 1
      },
      "desc": [
        [
          "快速生产: 相邻左侧卡牌获得<1>水晶塔",
          "快速生产: 相邻左侧卡牌获得<2>水晶塔"
        ],
        [
          "每回合结束时, 相邻两侧卡牌各摧毁1水晶塔, 每摧毁1水晶塔, 此卡牌获得<4>陆战队员",
          "每回合结束时, 相邻两侧卡牌各摧毁1水晶塔, 每摧毁1水晶塔, 此卡牌获得<8>陆战队员"
        ]
      ],
      "type": "card",
      "pack": "并肩作战",
      "pool": true,
      "level": 2
    },
    {
      "name": "生物质发电",
      "race": "P",
      "unit": {
        "使徒(精英)": 2,
        "蟑螂": 2,
        "水晶塔": 2
      },
      "desc": [
        [
          "出售任意三星及以上的虫族牌时, 此卡牌获得<1>水晶塔",
          "出售任意三星及以上的虫族牌时, 此卡牌获得<2>水晶塔"
        ]
      ],
      "type": "card",
      "pack": "并肩作战",
      "pool": true,
      "level": 2
    },
    {
      "name": "生化危机",
      "race": "Z",
      "unit": {
        "牛头人陆战队员": 1,
        "刺蛇(精英)": 4
      },
      "desc": [
        [
          "每回合结束时, 若拥有至少2科技挂件, 则注卵<1>牛头人陆战队员和<2>科技实验室",
          "每回合结束时, 若拥有至少2科技挂件, 则注卵<2>牛头人陆战队员和<4>科技实验室"
        ]
      ],
      "rmrk": "卵牌中的科技实验室可以参与人族卡牌效果的科技实验室计数",
      "type": "card",
      "pack": "并肩作战",
      "pool": true,
      "level": 5
    },
    {
      "name": "虚空裂痕",
      "attr": {
        "dark": true,
        "void": true
      },
      "race": "N",
      "unit": {
        "虚空裂隙": 1,
        "百夫长": 2
      },
      "desc": [
        [
          "获得黑暗值时, 获得<1>百夫长",
          "获得黑暗值时, 获得<2>百夫长"
        ],
        [
          "5黑暗值时单位复活1次",
          "5黑暗值时单位复活1次"
        ],
        [
          "每回合结束时, 若晶体矿数量≥1, 则获得<2>百夫长",
          "每回合结束时, 若晶体矿数量≥1, 则获得<4>百夫长"
        ]
      ],
      "type": "card",
      "pack": "并肩作战",
      "pool": true,
      "level": 5
    },
    {
      "name": "以火治火",
      "race": "T",
      "unit": {
        "火蝠": 6,
        "反应堆": 1
      },
      "desc": [
        [
          "每回合开始时, 所有具有反应堆的人族卡牌获得<1>火蝠",
          "每回合开始时, 所有具有反应堆的人族卡牌获得<2>火蝠"
        ],
        [
          "快速生产: 所有人族卡牌将<2>火蝠精英化",
          "快速生产: 所有人族卡牌将<3>火蝠精英化"
        ]
      ],
      "type": "card",
      "pack": "快速启动",
      "pool": true,
      "level": 3
    },
    {
      "name": "六脉神剑",
      "race": "T",
      "unit": {
        "先知": 4,
        "水晶塔": 1
      },
      "desc": [
        [
          "任意卡牌进场时, 若先知数量小于能量强度, 则折跃<1>先知",
          "任意卡牌进场时, 若先知数量小于能量强度, 则折跃<2>先知"
        ]
      ],
      "type": "card",
      "pack": "快速启动",
      "pool": true,
      "level": 3
    },
    {
      "name": "优质基因",
      "attr": {
        "insert": true
      },
      "race": "Z",
      "unit": {
        "巢虫领主": 2,
        "雷兽": 1
      },
      "desc": [
        [
          "每回合结束时, 摧毁所有虫卵牌并且所有虫族卡牌获得1虫卵牌中价值最高的<非英雄>单位",
          "每回合结束时, 摧毁所有虫卵牌并且所有虫族卡牌获得1虫卵牌中价值最高的单位"
        ]
      ],
      "type": "card",
      "pack": "快速启动",
      "pool": true,
      "level": 4
    },
    {
      "name": "埃蒙仆从",
      "attr": {
        "void": true
      },
      "race": "N",
      "unit": {
        "刺蛇(精英)": 2,
        "旋风狂热者(精英)": 2
      },
      "desc": [
        [
          "每回合结束时, 尝试同时摧毁1张虫族和神族卡牌, 使所有具有虚空投影的卡牌获得<2>混合体毁灭者",
          "每回合结束时, 尝试同时摧毁1张虫族和神族卡牌, 使所有具有虚空投影的卡牌获得<3>混合体毁灭者"
        ]
      ],
      "type": "card",
      "pack": "快速启动",
      "pool": true,
      "level": 4
    },
    {
      "name": "死亡之翼",
      "unit": {
        "凤凰": 4
      },
      "desc": [
        [
          "被夺取时, 获得<1>天霸",
          "被夺取时, 获得<2>天霸"
        ],
        [
          "任意卡牌三连时, 三连卡牌夺取此卡牌",
          "任意卡牌三连时, 三连卡牌夺取此卡牌"
        ]
      ],
      "type": "card",
      "pack": "拉克希尔",
      "race": "N",
      "pool": true,
      "level": 2
    },
    {
      "name": "虚空援军",
      "attr": {
        "void": true
      },
      "unit": {
        "攻城坦克": 3
      },
      "desc": [
        [
          "进场时, 此卡牌尝试消耗1瓦斯获得随机升级",
          "进场时, 此卡牌尝试消耗1瓦斯获得随机升级"
        ],
        [
          "每回合结束时, 价值最高的卡牌夺取此卡牌, 保留升级",
          "每回合结束时, 价值最高的卡牌夺取此卡牌, 保留升级"
        ]
      ],
      "rmrk": "可以通过此卡牌使非虚影卡牌获得虚空能量升级",
      "type": "card",
      "pack": "拉克希尔",
      "race": "N",
      "pool": true,
      "level": 3
    },
    {
      "name": "深渊行者",
      "attr": {
        "dark": true
      },
      "unit": {
        "先锋": 3,
        "不死队": 3
      },
      "desc": [
        [
          "10黑暗值时单位复活1次",
          "10黑暗值时单位复活1次"
        ],
        [
          "任意卡牌被夺取时, 获得<1>先锋",
          "任意卡牌被夺取时, 获得<2>先锋"
        ]
      ],
      "type": "card",
      "pack": "拉克希尔",
      "race": "N",
      "pool": true,
      "level": 4
    },
    {
      "name": "黑暗祭坛",
      "attr": {
        "dark": true
      },
      "unit": {
        "黑暗执政官": 2,
        "凤凰": 2
      },
      "desc": [
        [
          "获得黑暗值时, 获得<1>凤凰",
          "获得黑暗值时, 获得<2>凤凰"
        ],
        [
          "每回合结束时, 夺取价值最低的卡牌",
          "每回合结束时, 夺取价值最低的卡牌"
        ]
      ],
      "type": "card",
      "pack": "拉克希尔",
      "race": "N",
      "pool": true,
      "level": 4
    },
    {
      "name": "原始蟑螂",
      "attr": {
        "origin": true
      },
      "unit": {
        "原始蟑螂": 4,
        "精华": 3
      },
      "desc": [
        [
          "供养(1): 原始蟑螂",
          "供养(1): 原始蟑螂"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 1
    },
    {
      "name": "不死队",
      "attr": {
        "dark": true
      },
      "unit": {
        "不死队": 4
      },
      "desc": [
        [
          "获得黑暗值时, 获得<1>不死队",
          "获得黑暗值时, 获得<2>不死队"
        ],
        [
          "8黑暗值时单位复活1次",
          "8黑暗值时单位复活1次"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 1
    },
    {
      "name": "紧急部署",
      "unit": {
        "自动机炮": 4,
        "修理无人机": 1
      },
      "desc": [],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 2
    },
    {
      "name": "原始刺蛇",
      "attr": {
        "origin": true
      },
      "unit": {
        "原始刺蛇": 7
      },
      "desc": [
        [
          "供养(1): 原始刺蛇",
          "供养(1): 原始刺蛇"
        ],
        [
          "每回合结束时, 获得<1>原始刺蛇和<2>精华",
          "每回合结束时, 获得<2>原始刺蛇和<4>精华"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 2
    },
    {
      "name": "原始异龙",
      "attr": {
        "origin": true
      },
      "unit": {
        "原始异龙": 4
      },
      "desc": [
        [
          "任意卡牌进场时, 相邻右侧卡牌获得<1>精华",
          "任意卡牌进场时, 相邻右侧卡牌获得<2>精华"
        ],
        [
          "每回合结束时, 若晶体矿数量≥1, 则摧毁所有卡牌中的精华, 每摧毁2精华, 获得1原始异龙",
          "每回合结束时, 若晶体矿数量≥1, 则摧毁所有卡牌中的精华, 每摧毁2精华, 获得1原始异龙"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 3
    },
    {
      "name": "虚空大军",
      "attr": {
        "void": true
      },
      "unit": {
        "歌利亚": 1,
        "刺蛇": 1,
        "龙骑士": 1
      },
      "desc": [
        [
          "每回合结束时, 若你拥有人族卡牌, 则获得<1>歌利亚; 若你拥有虫族卡牌, 则获得<1>刺蛇; 若你拥有神族卡牌, 则获得<1>龙骑士",
          "每回合结束时, 若你拥有人族卡牌, 则获得<2>歌利亚; 若你拥有虫族卡牌, 则获得<2>刺蛇; 若你拥有神族卡牌, 则获得<2>龙骑士"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 3
    },
    {
      "name": "鲜血猎手",
      "attr": {
        "dark": true
      },
      "unit": {
        "鲜血猎手": 6,
        "浩劫": 1
      },
      "desc": [
        [
          "获得黑暗值时, 获得<1>鲜血猎手",
          "获得黑暗值时, 获得<2>鲜血猎手"
        ],
        [
          "5黑暗值时单位复活1次",
          "5黑暗值时单位复活1次"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 3
    },
    {
      "name": "暴掠龙",
      "attr": {
        "origin": true
      },
      "unit": {
        "暴掠龙": 2
      },
      "desc": [
        [
          "供养(2): 暴掠龙",
          "供养(2): 暴掠龙"
        ],
        [
          "每回合结束时, 获得<1>暴掠龙和<2>精华",
          "每回合结束时, 获得<2>暴掠龙和<4>精华"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 3
    },
    {
      "name": "适者生存",
      "unit": {
        "亚格卓拉": 1
      },
      "desc": [
        [
          "每回合结束时, 将场上随机<5>个生物单位精英化",
          "每回合结束时, 将场上随机<8>个生物单位精英化"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 4
    },
    {
      "name": "毁灭者",
      "attr": {
        "dark": true
      },
      "unit": {
        "毁灭者": 4
      },
      "desc": [
        [
          "出售时, 相邻左侧卡牌获得等于黑暗值-1数量的毁灭者(不超过<10>)",
          "出售时, 相邻左侧卡牌获得等于黑暗值-1数量的毁灭者(不超过<30>)"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 4
    },
    {
      "name": "原始点火虫",
      "attr": {
        "origin": true
      },
      "unit": {
        "原始点火虫": 4,
        "精华": 2
      },
      "desc": [
        [
          "每回合结束时, 补充原始点火虫至精华数量的两倍, 最多补充到20",
          "每回合结束时, 补充原始点火虫至精华数量的两倍, 最多补充到20"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 4
    },
    {
      "name": "原始雷兽",
      "attr": {
        "origin": true
      },
      "unit": {
        "原始雷兽": 3
      },
      "desc": [
        [
          "供养(4): 原始雷兽",
          "供养(4): 原始雷兽"
        ],
        [
          "每回合结束时, 获得<1>原始雷兽并除自身外, 每有1张中立卡牌获得1精华",
          "每回合结束时, 获得<2>原始雷兽并除自身外, 每有1张中立卡牌获得1精华"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 4
    },
    {
      "name": "马拉什",
      "unit": {
        "马拉什": 1
      },
      "desc": [
        [
          "每回合结束时, 相邻两侧卡牌获得虚空投影增益",
          "每回合结束时, 相邻两侧卡牌获得虚空投影增益"
        ]
      ],
      "rmrk": "染黑",
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 5
    },
    {
      "name": "黑暗预兆",
      "attr": {
        "void": true
      },
      "unit": {
        "混合体毁灭者": 3
      },
      "desc": [
        [
          "每回合结束时, 若场上有4个种族的卡牌, 则获得<2>混合体毁灭者",
          "每回合结束时, 若场上有4个种族的卡牌, 则获得<4>混合体毁灭者"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 5
    },
    {
      "name": "阿拉纳克",
      "unit": {
        "阿拉纳克": 1
      },
      "desc": [
        [
          "进场时, 夺取除自身随机两张卡牌, 保留升级",
          "进场时, 夺取除自身随机两张卡牌, 保留升级"
        ]
      ],
      "rmrk": "不保留虚空投影增益\n会依次随机选取两张卡牌(不一定是先左后右)夺取, 超过数量上限的单位会被摧毁, 超过升级上限的升级会被舍弃",
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 5
    },
    {
      "name": "天罚行者",
      "attr": {
        "dark": true
      },
      "unit": {
        "天罚行者": 2
      },
      "desc": [
        [
          "进场时, 夺取4星及以下所有卡牌的黑暗值, 每夺取5点获得1天罚行者",
          "进场时, 夺取4星及以下所有卡牌的黑暗值, 每夺取5点获得1天罚行者"
        ],
        [
          "每回合结束时, 每有10黑暗值, 获得<1>天罚行者, 最多获得<2>",
          "每回合结束时, 每有10黑暗值, 获得<2>天罚行者, 最多获得<4>"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 5
    },
    {
      "name": "德哈卡",
      "attr": {
        "origin": true
      },
      "unit": {
        "德哈卡": 1,
        "德哈卡分身": 3
      },
      "desc": [
        [
          "任意卡牌出售时, 若其中精华数量≥3, 则获得<2>德哈卡分身",
          "任意卡牌出售时, 若其中精华数量≥3, 则获得<4>德哈卡分身"
        ],
        [
          "唯一: 每回合结束时, 若晶体矿数量≥1, 则下回合发现1张星级低于5星的原始虫群卡牌",
          "唯一: 每回合结束时, 若晶体矿数量≥1, 则下回合发现1张星级低于5星的原始虫群卡牌"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 5
    },
    {
      "name": "我叫小明",
      "banner": "第三届寿仙杯冠军: 我叫小明",
      "attr": {
        "rare": true,
        "insert": true
      },
      "unit": {
        "尤尔兰": 1
      },
      "desc": [
        [
          "进场时, 复制左侧相邻1-6星卡牌到暂存区",
          "进场时, 复制左侧相邻1-6星卡牌到暂存区"
        ],
        [
          "出售时, 左侧相邻卡牌获得星空加速升级",
          "出售时, 左侧相邻卡牌获得星空加速升级"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 6
    },
    {
      "name": "豆浆油条KT1",
      "banner": "第二届寿仙杯冠军: 豆浆油条",
      "attr": {
        "rare": true,
        "insert": true
      },
      "unit": {
        "武装机器人": 1
      },
      "desc": [
        [
          "进场时, 此卡牌和相邻卡牌获得随机升级",
          "进场时, 此卡牌和相邻卡牌获得随机升级"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 6
    },
    {
      "name": "豆浆油条",
      "banner": "第一届寿仙杯冠军: 豆浆油条",
      "attr": {
        "rare": true
      },
      "unit": {
        "赛兰迪丝": 1
      },
      "desc": [
        [
          "每回合结束时, 右侧所有卡牌获得虚空投影增益",
          "每回合结束时, 右侧所有卡牌获得虚空投影增益"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 6
    },
    {
      "name": "战斗号角",
      "banner": "酒馆官方社区平台: 号角",
      "attr": {
        "rare": true
      },
      "unit": {
        "虚空辉光舰(精英)": 4
      },
      "desc": [
        [
          "任意六星以下卡牌出售时, 获得其中价值最高的单位",
          "任意六星以下卡牌出售时, 获得其中价值最高的单位"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 6
    },
    {
      "name": "凯瑞甘",
      "attr": {
        "gold": true,
        "insert": true
      },
      "unit": {
        "莎拉·凯瑞甘": 1
      },
      "desc": [
        [
          "进场时, 吞噬左侧卡牌所有单位, 获得这些单位150%的生命和护盾",
          "进场时, 吞噬左侧卡牌所有单位, 获得这些单位150%的生命和护盾"
        ],
        [
          "进场时, 若两张凯瑞甘相邻, 合并为刀锋女王",
          "进场时, 若两张凯瑞甘相邻, 合并为刀锋女王"
        ]
      ],
      "rmrk": "本体的生命值只有1点\n被吞噬的卡牌视为被摧毁\n合并的女王位于先进场的凯瑞甘处\n进场后, 卡牌获得献祭升级\n虽然吞噬效果写在合并效果之前，但是进场时若能合并则并不会吞噬左侧卡牌",
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 6
    },
    {
      "name": "刀锋女王",
      "attr": {
        "gold": true
      },
      "pool": false,
      "unit": {
        "刀锋女王": 1
      },
      "desc": [
        [
          "唯一: 与你战斗的玩家虚空投影加成效果降低30%(最低为0)",
          "唯一: 与你战斗的玩家虚空投影加成效果降低30%(最低为0)"
        ]
      ],
      "rmrk": "通过凯瑞甘合并获得\n原文没有无法三连, 但是确实是暗金色卡牌",
      "type": "card",
      "pack": "核心",
      "race": "N",
      "level": 6
    },
    {
      "name": "虚空构造体",
      "attr": {
        "insert": true,
        "void": true
      },
      "unit": {
        "虚空构造体": 1
      },
      "desc": [
        [
          "唯一: 在场时, 虚空投影获得额外<20>%加成",
          "唯一: 在场时, 虚空投影获得额外<40>%加成"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "N",
      "pool": true,
      "level": 6
    },
    {
      "name": "死神火车",
      "unit": {
        "收割者": 3,
        "恶火": 2,
        "反应堆": 1
      },
      "desc": [
        [
          "任务: 让<1>张卡牌进场\n奖励: 获得<1>晶体矿",
          "任务: 让<2>张卡牌进场\n奖励: 获得<2>晶体矿"
        ]
      ],
      "rmrk": "虽然未三连的该卡牌提示需要进场1张卡牌, 但是任务计数是2, 这是因为需要绕过此卡牌进场本身\n由于三连不额外触发进场本身, 所以任务计数也是2。",
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 1
    },
    {
      "name": "好兄弟",
      "unit": {
        "陆战队员": 6,
        "反应堆": 1
      },
      "desc": [
        [
          "快速生产：获得<6>陆战队员",
          "快速生产：获得<4>陆战队员"
        ],
        [
          "反应堆生产陆战队员",
          "反应堆生产陆战队员"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 1
    },
    {
      "name": "挖宝奇兵",
      "attr": {
        "gold": true
      },
      "unit": {
        "响尾蛇战车": 3,
        "反应堆": 1
      },
      "desc": [
        [
          "任务: 刷新5次\n奖励: 发现1张等同于你当前酒馆星级的卡牌",
          "任务: 刷新5次\n奖励: 发现1张等同于你当前酒馆星级的卡牌"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 2
    },
    {
      "name": "实验室安保",
      "unit": {
        "陆战队员": 6,
        "医疗兵": 3,
        "反应堆": 1
      },
      "desc": [
        [
          "反应堆生产陆战队员",
          "反应堆生产陆战队员"
        ],
        [
          "进场时, 相邻两侧人族卡牌的挂件类型改变",
          "进场时, 相邻两侧人族卡牌的挂件类型改变"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 2
    },
    {
      "name": "征兵令",
      "attr": {
        "insert": true
      },
      "unit": {
        "陆战队员(精英)": 4,
        "陆战队员": 3,
        "反应堆": 1
      },
      "desc": [
        [
          "进场时, 抽取两侧人族卡牌三分之二的单位",
          "进场时, 抽取两侧人族卡牌三分之二的单位"
        ]
      ],
      "rmrk": "将两侧卡牌单位中序号(从1开始)模3不余1的非特殊建筑单位添加到此卡牌中\n对于抽取如下卡牌(通过将折跃援军紧急回收到好兄弟中): (A: 陆战队员, C: 反应堆, S: 追猎者, Z: 狂热者)\naAAaAAcSSzZ\n会抽取4A, 2S, 1Z(小写为被跳过的单位)\n被抽取的卡牌变动为\n抽取4A: ZZSSAAC\n抽取2S: ZZCAA\n抽取1Z: AZCA",
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 2
    },
    {
      "name": "恶火小队",
      "unit": {
        "恶火": 6,
        "反应堆": 1
      },
      "desc": [
        [
          "快速生产：获得1攻城坦克",
          "快速生产：获得1攻城坦克"
        ],
        [
          "反应堆生产恶火",
          "反应堆生产恶火"
        ],
        [
          "每回合结束时, 若拥有至少2科技挂件, 则获得<1>歌利亚",
          "每回合结束时, 若拥有至少2科技挂件, 则获得<2>歌利亚"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 2
    },
    {
      "name": "空投地雷",
      "unit": {
        "寡妇雷": 3,
        "反应堆": 1
      },
      "desc": [
        [
          "任意卡牌进场时, 获得<1>寡妇雷",
          "任意卡牌进场时, 获得<2>寡妇雷"
        ],
        [
          "快速生产：获得<2>寡妇雷",
          "快速生产：获得<3>寡妇雷"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 3
    },
    {
      "name": "步兵连队",
      "unit": {
        "陆战队员": 5,
        "医疗运输机": 2,
        "劫掠者": 3,
        "反应堆": 1
      },
      "desc": [
        [
          "快速生产：获得<3>劫掠者",
          "快速生产：获得<5>劫掠者"
        ],
        [
          "反应堆生产劫掠者",
          "反应堆生产劫掠者"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 3
    },
    {
      "name": "飙车流",
      "unit": {
        "秃鹫": 4,
        "飓风": 3,
        "科技实验室": 1
      },
      "desc": [
        [
          "快速生产：获得<3>秃鹫",
          "快速生产：获得<5>秃鹫"
        ],
        [
          "任务: 让3张人族卡牌进场\n奖励: 相邻左侧人族卡牌的挂件类型变为高级科技实验室",
          "任务: 让3张人族卡牌进场\n奖励: 相邻左侧人族卡牌的挂件类型变为高级科技实验室"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 3
    },
    {
      "name": "科考小队",
      "attr": {
        "insert": true
      },
      "unit": {
        "歌利亚": 4,
        "铁鸦": 2,
        "科技实验室": 1
      },
      "desc": [
        [
          "进场时, 相邻两侧人族卡牌的挂件类型改变",
          "进场时, 相邻两侧人族卡牌的挂件类型改变"
        ],
        [
          "任务: 刷新2次\n奖励: 获得<1>歌利亚\n每回合结束时, 重置此任务",
          "任务: 刷新2次\n奖励: 获得<2>歌利亚\n每回合结束时, 重置此任务"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 3
    },
    {
      "name": "陆军学院",
      "unit": {
        "战狼": 3,
        "维京战机": 2,
        "科技实验室": 1
      },
      "desc": [
        [
          "快速生产：获得<3>维京战机",
          "快速生产：获得<5>维京战机"
        ],
        [
          "每回合结束时, 若拥有至少3科技挂件, 则获得<1>战狼",
          "每回合结束时, 若拥有至少3科技挂件, 则获得<2>战狼"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 4
    },
    {
      "name": "空军学院",
      "unit": {
        "解放者": 3,
        "科技实验室": 1
      },
      "desc": [
        [
          "快速生产：获得<3>维京战机",
          "快速生产：获得<5>维京战机"
        ],
        [
          "任意任务完成时, 获得<1>解放者",
          "任意任务完成时, 获得<2>解放者"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 4
    },
    {
      "name": "交叉火力",
      "unit": {
        "攻城坦克": 2,
        "歌利亚": 3,
        "科技实验室": 1
      },
      "desc": [
        [
          "快速生产：获得<3>歌利亚",
          "快速生产：获得<5>歌利亚"
        ],
        [
          "每回合结束时, 若拥有至少5科技挂件, 则获得<1>攻城坦克",
          "每回合结束时, 若拥有至少5科技挂件, 则获得<2>攻城坦克"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 4
    },
    {
      "name": "枪兵坦克",
      "unit": {
        "陆战队员": 8,
        "攻城坦克": 2,
        "反应堆": 1
      },
      "desc": [
        [
          "每回合结束时, 所有具有反应堆的人族卡牌获得<2>陆战队员",
          "每回合结束时, 所有具有反应堆的人族卡牌获得<4>陆战队员"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 4
    },
    {
      "name": "斯台特曼",
      "attr": {
        "insert": true
      },
      "unit": {
        "斯台特曼": 1,
        "思旺": 1,
        "高级科技实验室": 1
      },
      "desc": [
        [
          "快速生产: 相邻两侧卡牌将<1>歌利亚和<1>维京战机精英化",
          "快速生产: 相邻两侧卡牌将<2>歌利亚和<2>维京战机精英化"
        ],
        [
          "进场时, 相邻左侧人族卡牌的挂件类型变为高级科技实验室",
          "进场时, 相邻左侧人族卡牌的挂件类型变为高级科技实验室"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 4
    },
    {
      "name": "护航中队",
      "unit": {
        "怨灵战机": 3,
        "黄昏之翼": 1,
        "科技实验室": 1
      },
      "desc": [
        [
          "快速生产：获得<1>黄昏之翼",
          "快速生产：获得<2>黄昏之翼"
        ],
        [
          "任意卡牌进场时, 获得<1>怨灵战机",
          "任意卡牌进场时, 获得<2>怨灵战机"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 5
    },
    {
      "name": "泰凯斯",
      "unit": {
        "泰凯斯": 1,
        "陆战队员(精英)": 6,
        "反应堆": 1,
        "医疗运输机": 2
      },
      "desc": [
        [
          "反应堆生产陆战队员(精英)",
          "反应堆生产陆战队员(精英)"
        ],
        [
          "每回合结束时, 所有人族卡牌将<3>陆战队员和<3>劫掠者精英化",
          "每回合结束时, 所有人族卡牌将<5>陆战队员和<5>劫掠者精英化"
        ],
        [
          "每回合结束时, 获得<1>医疗运输机",
          "每回合结束时, 获得<2>医疗运输机"
        ]
      ],
      "rmrk": "原文为'变为精英单位'",
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 5
    },
    {
      "name": "外籍军团",
      "attr": {
        "insert": true
      },
      "unit": {
        "牛头人陆战队员": 2,
        "鱼人陆战队员": 1,
        "反应堆": 1
      },
      "desc": [
        [
          "反应堆生产牛头人陆战队员",
          "反应堆生产牛头人陆战队员"
        ],
        [
          "进场时, 相邻两侧卡牌将每6个陆战队员变为1牛头人陆战队员(精英则只需要3个)",
          "进场时, 相邻两侧卡牌将每6个陆战队员变为1牛头人陆战队员(精英则只需要3个)"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 5
    },
    {
      "name": "钢铁洪流",
      "unit": {
        "雷神": 3,
        "战狼": 2,
        "科技实验室": 1
      },
      "desc": [
        [
          "快速生产：获得<1>雷神",
          "快速生产：获得<2>雷神"
        ],
        [
          "每回合结束时, 若拥有5科技挂件, 则所有卡牌将<1>攻城坦克和<1>战狼精英化",
          "每回合结束时, 若拥有5科技挂件, 则所有卡牌将<2>攻城坦克和<2>战狼精英化"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 5
    },
    {
      "name": "游骑兵",
      "unit": {
        "雷诺(指挥官)": 1,
        "反应堆": 1
      },
      "desc": [
        [
          "任意卡牌挂件变更时, 相应卡牌获得<1>雷诺(狙击手)",
          "任意卡牌挂件变更时, 相应卡牌获得<2>雷诺(狙击手)"
        ],
        [
          "反应堆生产雷诺(狙击手)",
          "反应堆生产雷诺(狙击手)"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 6
    },
    {
      "name": "沃菲尔德",
      "unit": {
        "沃菲尔德将军": 1,
        "帝盾卫兵": 3,
        "科技实验室": 1
      },
      "desc": [
        [
          "每回合结束时, 所有卡牌将<1>陆战队员(精英)变为帝盾卫兵",
          "每回合结束时, 所有卡牌将<2>陆战队员(精英)变为帝盾卫兵"
        ],
        [
          "唯一: 获得每回合出售的<第一>张人族卡牌的单位",
          "唯一: 获得每回合出售的<前两>张人族卡牌的单位"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 6
    },
    {
      "name": "帝国舰队",
      "unit": {
        "战列巡航舰": 4,
        "科技实验室": 1
      },
      "desc": [
        [
          "任务: 出售3张卡牌\n奖励: 获得<1>战列巡航舰并重置此任务",
          "任务: 出售3张卡牌\n奖励: 获得<2>战列巡航舰并重置此任务"
        ],
        [
          "每回合结束时, 若拥有至少4科技挂件, 则获得<2>黄昏之翼",
          "每回合结束时, 若拥有至少4科技挂件, 则获得<4>黄昏之翼"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "T",
      "pool": true,
      "level": 6
    },
    {
      "name": "虫群先锋",
      "unit": {
        "跳虫": 8,
        "爆虫": 3
      },
      "desc": [
        [
          "每回合结束时, 获得<2>跳虫",
          "每回合结束时, 获得<4>跳虫"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 1
    },
    {
      "name": "蟑螂小队",
      "unit": {
        "蟑螂": 3,
        "爆虫": 1
      },
      "desc": [
        [
          "每回合结束时, 将<1>蟑螂变为破坏者",
          "每回合结束时, 将<2>蟑螂变为破坏者"
        ],
        [
          "出售时, 注卵<2>蟑螂",
          "出售时, 注卵<4>蟑螂"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 1
    },
    {
      "name": "屠猎者",
      "unit": {
        "跳虫": 10,
        "刺蛇": 2
      },
      "desc": [
        [
          "每回合结束时, 将所有刺蛇变为刺蛇(精英)",
          "每回合结束时, 将所有刺蛇变为刺蛇(精英)"
        ],
        [
          "提升酒馆等级时, 获得<1>刺蛇(精英)",
          "提升酒馆等级时, 获得<2>刺蛇(精英)"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 2
    },
    {
      "name": "埋地刺蛇",
      "attr": {
        "insert": true
      },
      "unit": {
        "刺蛇": 6
      },
      "desc": [
        [
          "出售时, 注卵<3>刺蛇",
          "出售时, 注卵<6>刺蛇"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 2
    },
    {
      "name": "变异军团",
      "unit": {
        "被感染的陆战队员": 7
      },
      "desc": [
        [
          "任意卡牌注卵时, 获得<1>被感染的陆战队员",
          "任意卡牌注卵时, 获得<2>被感染的陆战队员"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 2
    },
    {
      "name": "孵化蟑螂",
      "unit": {
        "蟑螂": 4,
        "破坏者": 2
      },
      "desc": [
        [
          "每回合结束时, 孵化<1>蟑螂",
          "每回合结束时, 孵化<2>蟑螂"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 2
    },
    {
      "name": "爆虫滚滚",
      "unit": {
        "爆虫": 10
      },
      "desc": [
        [
          "每回合结束时, 每有<20>爆虫孵化1爆虫",
          "每回合结束时, 每有<15>爆虫孵化1爆虫"
        ],
        [
          "唯一: 获得任意出售卡牌中的跳虫, 并将其变为爆虫",
          "唯一: 获得任意出售卡牌中的跳虫, 并将其变为爆虫"
        ]
      ],
      "rmrk": "每回合只孵化一次\n跳虫(精英)将变为爆虫(精英)",
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 3
    },
    {
      "name": "飞龙骑脸",
      "attr": {
        "insert": true
      },
      "unit": {
        "跳虫": 15,
        "异龙": 5
      },
      "desc": [
        [
          "出售时, 孵化<2>异龙",
          "出售时, 孵化<4>异龙"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 3
    },
    {
      "name": "凶残巨兽",
      "unit": {
        "雷兽": 2
      },
      "desc": [
        [
          "出售时, 注卵<1>雷兽",
          "出售时, 注卵<2>雷兽"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 3
    },
    {
      "name": "注卵虫后",
      "unit": {
        "虫后": 5
      },
      "desc": [
        [
          "每回合开始时, 注卵<1>蟑螂和<1>刺蛇",
          "每回合开始时, 注卵<2>蟑螂和<2>刺蛇"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 3
    },
    {
      "name": "孵化所",
      "attr": {
        "insert": true
      },
      "unit": {
        "菌毯肿瘤": 1,
        "虫后": 2,
        "守卫": 2
      },
      "desc": [
        [
          "唯一: 任意卡牌孵化至此卡牌时, 额外孵化<2>单位",
          "唯一: 任意卡牌孵化至此卡牌时, 额外孵化<3>单位"
        ]
      ],
      "rmrk": "对于来自虫卵牌的孵化, 额外的单位是最后被注卵的单位",
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 4
    },
    {
      "name": "地底伏击",
      "attr": {
        "insert": true
      },
      "unit": {
        "潜伏者": 3
      },
      "desc": [
        [
          "进场时, 孵化<1>潜伏者",
          "进场时, 孵化<2>潜伏者"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 4
    },
    {
      "name": "孵化刺蛇",
      "unit": {
        "蟑螂": 4,
        "刺蛇(精英)": 3
      },
      "desc": [
        [
          "每回合结束时, 孵化<1>刺蛇(精英)",
          "每回合结束时, 孵化<2>刺蛇(精英)"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 4
    },
    {
      "name": "感染深渊",
      "unit": {
        "感染者": 2,
        "陆战队员": 3
      },
      "desc": [
        [
          "每回合结束时, 所有卡牌将<2>陆战队员变为被感染的陆战队员, 并将他们注卵",
          "每回合结束时, 所有卡牌将<4>陆战队员变为被感染的陆战队员, 并将他们注卵"
        ],
        [
          "每回合开始时, 所有卡牌将<1>被感染的陆战队员变为畸变体",
          "每回合开始时, 所有卡牌将<2>被感染的陆战队员变为畸变体"
        ]
      ],
      "rmrk": "不能注卵陆战队员(精英)",
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 4
    },
    {
      "name": "腐化大龙",
      "unit": {
        "腐化者": 6
      },
      "desc": [
        [
          "每回合结束时, 将<2>腐化者变为巢虫领主",
          "每回合结束时, 将<4>腐化者变为巢虫领主"
        ],
        [
          "出售时, 注卵<2>巢虫领主",
          "出售时, 注卵<4>巢虫领主"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 5
    },
    {
      "name": "空中管制",
      "attr": {
        "insert": true
      },
      "unit": {
        "异龙(精英)": 4,
        "飞蛇": 1
      },
      "desc": [
        [
          "进场时, 孵化<3>爆蚊",
          "进场时, 孵化<6>爆蚊"
        ],
        [
          "每回合结束时, 孵化<1>异龙(精英)",
          "每回合结束时, 孵化<2>异龙(精英)"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 5
    },
    {
      "name": "虫群大军",
      "unit": {
        "雷兽": 2,
        "刺蛇": 8
      },
      "desc": [
        [
          "每回合结束时, 若拥有至少4张虫族卡牌, 则注卵<1>雷兽",
          "每回合结束时, 若拥有至少4张虫族卡牌, 则注卵<2>雷兽"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 5
    },
    {
      "name": "终极进化",
      "attr": {
        "insert": true
      },
      "unit": {
        "莽兽": 2
      },
      "desc": [
        [
          "进场时, 相邻两侧卡牌将<1>蟑螂变为莽兽",
          "进场时, 相邻两侧卡牌将<2>蟑螂变为莽兽"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 5
    },
    {
      "name": "凶猛巨兽",
      "unit": {
        "利维坦": 1
      },
      "desc": [
        [
          "进场时, 所有虫族卡牌获得<2>腐化者",
          "进场时, 所有虫族卡牌获得<4>腐化者"
        ],
        [
          "每回合结束时, 相邻两侧虫族卡牌获得<2>守卫",
          "每回合结束时, 相邻两侧虫族卡牌获得<4>守卫"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 6
    },
    {
      "name": "扎加拉",
      "unit": {
        "扎加拉": 1
      },
      "desc": [
        [
          "唯一: 任意卡牌进行孵化时, 单位额外孵化到此卡牌",
          "唯一: 任意卡牌进行孵化时, 单位额外孵化到此卡牌<, 并且此卡牌获得1巢虫领主>"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 6
    },
    {
      "name": "斯图科夫",
      "unit": {
        "斯图科夫": 1
      },
      "desc": [
        [
          "唯一: <偶数次>六星以下的非虫族卡牌进场时, 将其中的非英雄单位注卵",
          "唯一: <任意>六星以下的非虫族卡牌进场时, 将其中的非英雄单位注卵"
        ]
      ],
      "rmrk": "原文为'注卵到最左侧的虫卵牌', 但是并不存在对应情况\n对于跳虫这一角色, 会向两个卵牌注卵",
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "pool": true,
      "level": 6
    },
    {
      "name": "虫卵",
      "pool": false,
      "unit": {},
      "desc": [
        [
          "每回合开始时, 如果相邻两侧的卡牌时虫族卡牌, 摧毁这张牌, 获得1晶体矿并孵化其中的生物单位",
          "每回合开始时, 如果相邻两侧的卡牌时虫族卡牌, 摧毁这张牌, 获得1晶体矿并孵化其中的生物单位"
        ]
      ],
      "rmrk": "是金色卡牌",
      "type": "card",
      "pack": "核心",
      "race": "Z",
      "level": 0
    },
    {
      "name": "折跃援军",
      "unit": {
        "追猎者": 2,
        "狂热者": 1
      },
      "desc": [
        [
          "出售时, 折跃<1>狂热者和<2>追猎者",
          "出售时, 折跃<2>狂热者和<4>追猎者"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 1
    },
    {
      "name": "发电站",
      "unit": {
        "使徒": 4,
        "水晶塔": 1,
        "虚空水晶塔": 1
      },
      "desc": [],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 1
    },
    {
      "name": "供能中心",
      "attr": {
        "insert": true
      },
      "unit": {
        "使徒(精英)": 3,
        "追猎者": 2,
        "虚空水晶塔": 1
      },
      "desc": [
        [
          "提升酒馆等级时, 获得<1>水晶塔",
          "提升酒馆等级时, 获得<2>水晶塔"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 2
    },
    {
      "name": "龙骑兵团",
      "unit": {
        "龙骑士": 5,
        "零件": 3,
        "水晶塔": 1
      },
      "desc": [
        [
          "每回合结束时, 获得<2>零件",
          "每回合结束时, 获得<4>零件"
        ],
        [
          "出售时, 折跃n龙骑士(n=零件数量)",
          "出售时, 折跃n龙骑士(n=零件数量)"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 2
    },
    {
      "name": "万叉奔腾",
      "unit": {
        "狂热者": 6,
        "水晶塔": 1
      },
      "desc": [
        [
          "集结(2): 获得<1>狂热者",
          "集结(2): 获得<2>狂热者"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 2
    },
    {
      "name": "折跃信标",
      "unit": {
        "机械哨兵": 4,
        "不朽者": 1,
        "水晶塔": 1
      },
      "desc": [
        [
          "唯一: 你的折跃效果总是添加到这张牌上",
          "唯一: 你的折跃效果总是添加到这张牌上"
        ]
      ],
      "rmrk": "原文没有唯一, 此处根据实际效果添加该标签",
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 2
    },
    {
      "name": "艾尔之刃",
      "attr": {
        "insert": true
      },
      "unit": {
        "狂热者": 6,
        "高阶圣堂武士": 2,
        "水晶塔": 1
      },
      "desc": [
        [
          "进场时, 相邻两侧神族卡牌获得<1>水晶塔",
          "进场时, 相邻两侧神族卡牌获得<2>水晶塔"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 3
    },
    {
      "name": "折跃部署",
      "unit": {
        "折跃棱镜": 1,
        "不朽者": 1,
        "狂热者": 4
      },
      "desc": [
        [
          "每回合结束时, 折跃<2>追猎者",
          "每回合结束时, 折跃<3>追猎者"
        ],
        [
          "每回合开始时, 折跃<1>狂热者",
          "每回合开始时, 折跃<2>狂热者"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 3
    },
    {
      "name": "暗影卫队",
      "unit": {
        "黑暗圣堂武士": 5,
        "水晶塔": 1
      },
      "desc": [
        [
          "集结(3): 获得<1>黑暗圣堂武士",
          "集结(3): 获得<2>黑暗圣堂武士"
        ],
        [
          "能量强度≥6时, 额外获得1黑暗圣堂武士",
          "能量强度≥6时, 额外获得1黑暗圣堂武士"
        ]
      ],
      "rmrk": "开门! 暗影卫队查地嗪",
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 3
    },
    {
      "name": "重回战场",
      "unit": {
        "不朽者": 3,
        "水晶塔": 2
      },
      "desc": [
        [
          "进场时, 所有神族卡牌将<1>生物单位变为不朽者",
          "进场时, 所有神族卡牌将<2>生物单位变为不朽者"
        ],
        [
          "出售时, 折跃<1>不朽者",
          "出售时, 折跃<2>不朽者"
        ]
      ],
      "rmrk": "变不朽的顺序时按照卡牌上的单位从上到下选取\n英雄单位会变为英雄不朽者\n所以快把大主教装罐吧",
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 3
    },
    {
      "name": "折跃攻势",
      "unit": {
        "折跃棱镜": 1,
        "追猎者(精英)": 4,
        "水晶塔": 2
      },
      "desc": [
        [
          "任意卡牌折跃时, 获得<1>追猎者",
          "任意卡牌折跃时, 获得<2>追猎者"
        ]
      ],
      "rmrk": "养鸡场",
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 4
    },
    {
      "name": "净化者军团",
      "unit": {
        "狂热者(精英)": 3,
        "掠夺者": 2,
        "水晶塔": 2
      },
      "desc": [
        [
          "集结(5): 所有神族卡牌将<1>地面非重型单位精英化, 并一同折跃他们",
          "集结(5): 所有神族卡牌将<2>地面非重型单位精英化, 并一同折跃他们"
        ]
      ],
      "rmrk": "此卡牌可以精英化神族卡牌中的非神族单位，如通过虚空援军添加的攻城坦克\n卡面描述中的一同折跃, 是指将所有神族卡牌被精英化的单位一起折跃, 算折跃一次",
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 4
    },
    {
      "name": "凯拉克斯",
      "unit": {
        "凯拉克斯": 1,
        "巨像": 1,
        "虚空水晶塔": 1
      },
      "desc": [
        [
          "每回合结束时, 随机折跃<1>个不朽者/掠夺者/巨像",
          "每回合结束时, 随机折跃<2>个不朽者/掠夺者/巨像"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 4
    },
    {
      "name": "虚空舰队",
      "attr": {
        "insert": true
      },
      "unit": {
        "虚空辉光舰": 4,
        "虚空水晶塔": 1
      },
      "desc": [
        [
          "集结(5): 折跃<1>虚空辉光舰",
          "集结(5): 折跃<2>虚空辉光舰"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 4
    },
    {
      "name": "势不可挡",
      "unit": {
        "执政官": 4,
        "水晶塔": 2
      },
      "desc": [
        [
          "进场时, 折跃1执政官(精英)",
          "进场时, 折跃1执政官(精英)"
        ],
        [
          "集结(5): 折跃<1>执政官",
          "集结(5): 折跃<2>执政官"
        ],
        [
          "若能量强度≥15, 额外折跃1执政官(精英)",
          "若能量强度≥15, 额外折跃1执政官(精英)"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 4
    },
    {
      "name": "黄金舰队",
      "unit": {
        "航母": 2,
        "风暴战舰": 1,
        "水晶塔": 1,
        "虚空水晶塔": 1
      },
      "desc": [
        [
          "集结(5): 获得<1>侦察机",
          "集结(5): 获得<2>侦察机"
        ],
        [
          "集结(7): 获得<1>风暴战舰",
          "集结(7): 获得<2>风暴战舰"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 5
    },
    {
      "name": "莫汗达尔",
      "unit": {
        "莫汗达尔": 1
      },
      "desc": [
        [
          "唯一: 任意卡牌折跃时, 复制折跃的最后<1>个单位到此卡牌",
          "唯一: 任意卡牌折跃时, 复制折跃的最后<2>个单位到此卡牌"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 5
    },
    {
      "name": "光复艾尔",
      "unit": {
        "泰坦棱镜": 1
      },
      "desc": [
        [
          "获得升级时, 展开泰坦棱镜",
          "获得升级时, 展开泰坦棱镜"
        ],
        [
          "唯一: 泰坦棱镜展开时, 获得出售的神族卡牌的<非英雄>单位和水晶塔(不包括虚空水晶塔), 同时收起",
          "唯一: 泰坦棱镜展开时, 获得出售的神族卡牌的单位和水晶塔(不包括虚空水晶塔), 同时收起"
        ]
      ],
      "rmrk": "原文没有唯一, 此处根据实际效果添加该标签",
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 5
    },
    {
      "name": "菲尼克斯",
      "attr": {
        "insert": true
      },
      "unit": {
        "菲尼克斯": 1,
        "旋风狂热者(精英)": 3,
        "掠夺者": 1
      },
      "desc": [
        [
          "进场时, 将两侧卡牌的狂热者和使徒变为旋风狂热者",
          "进场时, 将两侧卡牌的狂热者和使徒变为旋风狂热者"
        ],
        [
          "集结(5): 获得<1>掠夺者",
          "集结(5): 获得<2>掠夺者"
        ]
      ],
      "rmrk": "原文为'尝试将', 此处由于没有实际意义删去\n狂热者(精英)和使徒(精英)会被变为旋风狂热者(精英)",
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 5
    },
    {
      "name": "酒馆后勤处",
      "banner": "酒馆教学视频: bilibili酒馆后勤处",
      "attr": {
        "rare": true
      },
      "unit": {
        "科罗拉里昂": 1,
        "卡尔达利斯": 1
      },
      "desc": [
        [
          "我们需要集结更多观众!",
          "我们需要集结更多观众!"
        ],
        [
          "进场时, 所有神族卡牌无条件触发2次集结效果",
          "进场时, 所有神族卡牌无条件触发2次集结效果"
        ]
      ],
      "rmrk": "这张稀有卡牌三连不改变属性\n后勤处真的还在更新吗(\n土子哥，你还有很多视频没有做，还不能休息哦~",
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 6
    },
    {
      "name": "净化一切",
      "unit": {
        "巨像(精英)": 2,
        "水晶塔": 3
      },
      "desc": [
        [
          "集结(4): 折跃<1>狂热者(精英)",
          "集结(4): 折跃<2>狂热者(精英)"
        ],
        [
          "若能量强度≥7, 额外折跃<1>巨像(精英)",
          "若能量强度≥7, 额外折跃<2>巨像(精英)"
        ]
      ],
      "rmrk": "折跃巨像(精英)不是集结词条, 不会因为14能量强度折跃两次",
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 6
    },
    {
      "name": "阿尔达瑞斯",
      "unit": {
        "仲裁者": 1
      },
      "desc": [
        [
          "唯一: 每回合结束时, 若拥有至少5张神族卡牌, 获得<1>英雄不朽者",
          "唯一: 每回合结束时, 若拥有至少5张神族卡牌, 获得<2>英雄不朽者"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 6
    },
    {
      "name": "阿塔尼斯",
      "unit": {
        "阿塔尼斯": 1,
        "掠夺者": 2,
        "虚空水晶塔": 1
      },
      "desc": [
        [
          "每回合结束时, 获得2旋风狂热者(精英)",
          "每回合结束时, 获得2旋风狂热者(精英)<和2阿塔尼斯>"
        ],
        [
          "唯一: 你的所有集结卡牌每回合无条件额外集结一次",
          "唯一: 你的所有集结卡牌每回合无条件额外集结一次"
        ]
      ],
      "rmrk": "我得重新集结部队!\n由于大主教是卡牌的第一个单位，因此你总是可以用重回战场把大主教装罐",
      "type": "card",
      "pack": "核心",
      "race": "P",
      "pool": true,
      "level": 6
    },
    {
      "name": "基因突变",
      "attr": {
        "insert": true
      },
      "race": "Z",
      "unit": {
        "破坏者(精英)": 1,
        "破坏者": 2
      },
      "desc": [
        [
          "进场和出售时, 相邻两侧虫族卡牌将价值最低的<1>个单位变为价值最高的非英雄单位",
          "进场和出售时, 相邻两侧虫族卡牌将价值最低的<2>个单位变为价值最高的非英雄单位"
        ]
      ],
      "type": "card",
      "pack": "独辟蹊径",
      "pool": true,
      "level": 3
    },
    {
      "name": "复制中心",
      "race": "T",
      "unit": {
        "幽魂": 2,
        "歌利亚(精英)": 2,
        "反应堆": 1
      },
      "desc": [
        [
          "快速生产: 获得每张暂存卡牌的<1>非英雄生物单位",
          "快速生产: 获得每张暂存卡牌的<2>非英雄生物单位"
        ]
      ],
      "type": "card",
      "pack": "独辟蹊径",
      "pool": true,
      "level": 4
    },
    {
      "name": "晋升仪式",
      "attr": {
        "insert": true
      },
      "race": "P",
      "unit": {
        "不朽者": 2,
        "狂热者(精英)": 2,
        "水晶塔": 2
      },
      "desc": [
        [
          "集结(4): 将<1>不朽者变为英雄不朽者并将<1>生物单位变为高阶圣堂武士",
          "集结(4): 将<2>不朽者变为英雄不朽者并将<2>生物单位变为高阶圣堂武士"
        ]
      ],
      "type": "card",
      "pack": "独辟蹊径",
      "pool": true,
      "level": 4
    },
    {
      "name": "风暴英雄",
      "attr": {
        "gold": true
      },
      "race": "N",
      "unit": {
        "沃拉尊": 1
      },
      "desc": [
        [
          "获得升级时, 随机获得1英雄(包含: 马拉什, 阿拉纳克, 利维坦, 虚空构造体, 科罗拉里昂)",
          "获得升级时, 随机获得1英雄(包含: 马拉什, 阿拉纳克, 利维坦, 虚空构造体, 科罗拉里昂)"
        ]
      ],
      "type": "card",
      "pack": "独辟蹊径",
      "pool": true,
      "level": 5
    },
    {
      "name": "雷兽窟",
      "race": "Z",
      "unit": {
        "幼雷兽": 5
      },
      "desc": [
        [
          "每回合开始时, 将<1>幼雷兽变为雷兽",
          "每回合开始时, 将<2>幼雷兽变为雷兽"
        ],
        [
          "每回合结束时, 孵化<1>幼雷兽",
          "每回合结束时, 孵化<2>幼雷兽"
        ]
      ],
      "type": "card",
      "pack": "短兵相接",
      "pool": true,
      "level": 3
    },
    {
      "name": "帝国敢死队",
      "race": "T",
      "unit": {
        "诺娃": 3,
        "反应堆": 1
      },
      "desc": [
        [
          "快速生产: 获得2诺娃",
          "快速生产: 获得2诺娃"
        ],
        [
          "反应堆生产诺娃",
          "反应堆生产诺娃"
        ],
        [
          "任意任务完成时, 获得<1>诺娃",
          "任意任务完成时, 获得<2>诺娃"
        ]
      ],
      "type": "card",
      "pack": "短兵相接",
      "pool": true,
      "level": 5
    },
    {
      "name": "黑暗教长",
      "race": "P",
      "unit": {
        "泽拉图": 1,
        "虚空水晶塔": 1
      },
      "desc": [
        [
          "进场时, 获得暗影战士升级",
          "进场时, 获得暗影战士升级"
        ],
        [
          "集结(5): 获得<1>黑暗圣堂武士(精英)",
          "集结(5): 获得<2>黑暗圣堂武士(精英)"
        ]
      ],
      "type": "card",
      "pack": "短兵相接",
      "pool": true,
      "level": 5
    },
    {
      "name": "混合体巨兽",
      "attr": {
        "void": true
      },
      "race": "N",
      "unit": {
        "混合体巨兽": 2
      },
      "desc": [
        [
          "每回合结束时, 若场上有4个种族的卡牌, 则获得<1>混合体巨兽",
          "每回合结束时, 若场上有4个种族的卡牌, 则获得<2>混合体巨兽"
        ]
      ],
      "type": "card",
      "pack": "短兵相接",
      "pool": true,
      "level": 6
    },
    {
      "name": "岗哨机枪",
      "race": "N",
      "unit": {},
      "desc": [
        [
          "建筑卡",
          "建筑卡"
        ],
        [
          "每回合结束时, 将每个自动机炮变为2岗哨机枪",
          "每回合结束时, 将每个自动机炮变为2岗哨机枪"
        ],
        [
          "任意卡牌进场时, 获得<2>岗哨机枪",
          "任意卡牌进场时, 获得<3>岗哨机枪"
        ]
      ],
      "type": "card",
      "pack": "核心",
      "pool": false,
      "level": 1
    }
  ],
  "term": [
    {
      "name": "供养",
      "bref": "出售时, 每有x个精华, 右侧相邻卡牌获得1对应的单位; 如果右侧卡牌属于原始虫群, 则将出售的精华转移给它",
      "type": "term",
      "race": "N"
    },
    {
      "name": "原始虫群",
      "bref": "卡牌种类",
      "extr": "卡牌拥有专属中立原始升级",
      "type": "term",
      "race": "N"
    },
    {
      "name": "黑暗容器",
      "bref": "相邻的非虫卵牌被摧毁或出售时, 若其星级≤3, 则获得1黑暗值, 否则获得2黑暗值",
      "type": "term",
      "race": "N"
    },
    {
      "name": "黑暗值",
      "bref": "部分黑暗容器卡牌拥有特定数量黑暗值后可以复活或触发额外效果",
      "type": "term",
      "race": "N"
    },
    {
      "name": "复活",
      "bref": "单位死亡后, 原地生成一个拥有50%血量, 没有升级的对应单位",
      "type": "term",
      "race": "N"
    },
    {
      "name": "虚空投影",
      "bref": "每拥有一种其他种族的卡牌, 这张卡牌的单位获得15%生命和护盾值加成",
      "extr": "初始拥有此增益的卡牌属于虚影",
      "type": "term",
      "race": "N"
    },
    {
      "name": "虚影",
      "bref": "卡牌种类",
      "extr": "卡牌拥有虚空投影增益\n卡牌拥有专属中立虚影升级",
      "type": "term",
      "race": "N"
    },
    {
      "name": "夺取",
      "bref": "摧毁指定卡牌, 并获得其中的单位",
      "type": "term",
      "race": "N"
    },
    {
      "name": "摧毁",
      "bref": "将卡牌从场上移除, 不触发出售效果, 不获得晶体矿",
      "type": "term",
      "race": "N"
    },
    {
      "name": "任务",
      "bref": "达成指定条件后触发奖励效果, 三连时会重置任务进度",
      "type": "term",
      "race": "T"
    },
    {
      "name": "科技挂件",
      "bref": "科技实验室或高级科技实验室",
      "type": "term",
      "race": "T"
    },
    {
      "name": "挂件",
      "bref": "所有人族卡牌初始均拥有反应堆或科技实验室, 可以通过特定卡牌更换挂件",
      "extr": "可以通过实验室安保或科考小队切换挂件, 或是通过飙车流或斯台特曼将挂件变为高级科技实验室",
      "type": "term",
      "race": "T"
    },
    {
      "name": "快速生产",
      "bref": "卡牌的挂件类型改变时触发一次",
      "extr": "拥有高级科技实验室的卡牌, 每回合结束时触发一次",
      "type": "term",
      "race": "T"
    },
    {
      "name": "挂件变更",
      "bref": "将卡牌的反应堆或科技实验室变为另外一个, 对高级科技实验室无效",
      "type": "term",
      "race": "T"
    },
    {
      "name": "注卵",
      "bref": "尝试向虫卵牌添加单位, 若没有虫卵牌, 则尝试在空位上创建一张虫卵牌, 再继续添加单位",
      "type": "term",
      "race": "Z"
    },
    {
      "name": "孵化",
      "bref": "向相邻两侧虫族卡牌添加单位",
      "type": "term",
      "race": "Z"
    },
    {
      "name": "折跃",
      "bref": "向你的随机神族卡牌添加单位",
      "type": "term",
      "race": "P"
    },
    {
      "name": "集结",
      "bref": "每回合结束时, 此卡牌能量强度满足x则触发1次, 满足2x则触发2次, 最多2次",
      "type": "term",
      "race": "P"
    },
    {
      "name": "能量强度",
      "bref": "由水晶塔和虚空水晶塔提供, 用于集结词条和护盾充能升级",
      "type": "term",
      "race": "P"
    },
    {
      "name": "卡牌单位",
      "bref": "进场后, 卡牌中的单位按照一个数组存储",
      "extr": "卡牌进场后, 根据卡牌的单位信息, 依次添加单位到数组中. 如交叉火力卡牌, 进场后卡牌内的单位为:\n攻城坦克, 攻城坦克, 歌利亚, 歌利亚, 歌利亚, 科技实验室\n当需要删除卡牌时, 将最后一个单位移动到被删除单位处, 然后总长度-1. 如删除第二个攻城坦克, 单位变为:\n攻城坦克, 科技实验室, 歌利亚, 歌利亚, 歌利亚",
      "type": "term",
      "race": "G"
    },
    {
      "name": "定点部署",
      "bref": "进场时, 可以指定部署位置",
      "extr": "卡牌进场时可以选择部署位置, 若位置上已有卡牌:\n若选择的位置右侧有空位, 将选择位置的卡牌及其右侧连续的若干张卡牌右移1格, 否则将选择位置的卡牌及其左侧连续的若干张卡牌左移1格, 最后部署卡牌",
      "type": "term",
      "race": "G"
    },
    {
      "name": "进场",
      "bref": "卡牌从商店或暂存区置入场内",
      "type": "term",
      "race": "G"
    },
    {
      "name": "出售",
      "bref": "进场的卡牌出售",
      "type": "term",
      "race": "G"
    },
    {
      "name": "唯一",
      "bref": "若多张卡牌具有该效果, 仅最左侧起效",
      "type": "term",
      "race": "G"
    },
    {
      "name": "金色卡牌",
      "bref": "三连后的卡牌",
      "extr": "部分特殊效果能使卡牌变为金色, 如黄金矿工",
      "type": "term",
      "race": "G"
    },
    {
      "name": "无法三连",
      "bref": "无法三连, 视为金色卡牌",
      "type": "term",
      "race": "G"
    },
    {
      "name": "三连",
      "bref": "将新卡牌与场上最左侧2张非金色卡牌的同名卡牌合并至左侧的卡牌, 改为金色卡牌, 发现1张等同于你当前酒馆星级+1的卡牌或1个三连升级, 触发卡牌的进场效果",
      "type": "term",
      "race": "G"
    },
    {
      "name": "发现",
      "bref": "从若干个(一般为3个)可选项中选择一项获得\n若获得卡牌时暂存区已满, 则直接进场",
      "type": "term",
      "race": "G"
    },
    {
      "name": "精英化",
      "bref": "将存在对应精英单位的单位变为对应精英单位",
      "type": "term",
      "race": "G"
    },
    {
      "name": "无法叠加",
      "bref": "获得多个该升级只会产生单个升级的效果",
      "type": "term",
      "race": "G"
    },
    {
      "name": "特殊升级",
      "bref": "只能通过特殊方法获得的升级",
      "extr": "除了献祭均可以通过虚空援军和斯台特曼的技能获得(存疑)\n献祭: 凯瑞甘进场时获得\n轨道空降: 通过诺娃的尖端科技辅助卡获得\n暗影战士: 暗影卫队和黑暗教长进场时获得, 幽灵的隐身模式也可获得\n完美冻结: 没有固定的获得方式",
      "type": "term",
      "race": "G"
    },
    {
      "name": "三连升级",
      "bref": "卡牌三连时, 若卡牌升级数量未达到上限, 可发现一个三连升级",
      "type": "term",
      "race": "G"
    },
    {
      "name": "人族升级",
      "bref": "人族卡牌的专属升级",
      "type": "term",
      "race": "G"
    },
    {
      "name": "虫族升级",
      "bref": "虫族卡牌的专属升级",
      "type": "term",
      "race": "G"
    },
    {
      "name": "神族升级",
      "bref": "神族卡牌的专属升级",
      "type": "term",
      "race": "G"
    },
    {
      "name": "公共升级",
      "bref": "所有卡牌均可以获得的升级",
      "extr": "一共12个公共升级, 对于没有专属升级的卡牌, 点出黄金矿工的概率为C(3,11) / C(4,12) = 1/3",
      "type": "term",
      "race": "G"
    },
    {
      "name": "中立虚影升级",
      "bref": "虚影卡牌的专属升级",
      "type": "term",
      "race": "G"
    },
    {
      "name": "中立原始升级",
      "bref": "原始虫群卡牌的专属升级",
      "type": "term",
      "race": "G"
    },
    {
      "name": "专属升级",
      "bref": "加入卡牌的可选升级池\n若拥有专属升级, 除非所有专属升级均已获得, 否则第四个升级一定属于专属升级",
      "type": "term",
      "race": "G"
    }
  ],
  "unit": [
    {
      "name": "被感染的女妖",
      "race": "Z",
      "value": 200,
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "末日巨兽",
      "race": "Z",
      "value": 3000,
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "恶蝠游骑兵",
      "race": "T",
      "value": 650,
      "health": 400,
      "tag": [
        "轻甲",
        "生物单位",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "爆燃汽油喷射器",
          "damage": 36,
          "range": 2,
          "speed": 1.43,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 3,
        "speed": 3.15
      },
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "死亡之握水晶",
      "race": "N",
      "value": 1000,
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "女妖",
      "race": "T",
      "value": 250,
      "health": 140,
      "tag": [
        "轻甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "反冲火箭",
          "damage": 12,
          "multiple": 2,
          "range": 6,
          "speed": 0.89,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类舰船钢板",
        "defense": 0,
        "speed": 3.85
      },
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "塔达林母舰",
      "race": "N",
      "value": 500,
      "health": 800,
      "shield": 400,
      "tag": [
        "重甲",
        "机械单位",
        "灵能单位",
        "重型单位",
        "英雄单位"
      ],
      "weapon": [
        {
          "name": "净化光束",
          "damage": 24,
          "multiple": 6,
          "range": 7,
          "speed": 1.58,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "星灵护板",
        "defense": 4,
        "speed": 1.97
      },
      "type": "unit",
      "utyp": "normal",
      "sarmor": {
        "name": "星灵等离子护盾",
        "defense": 0
      }
    },
    {
      "name": "虚空裂隙",
      "race": "N",
      "value": 0,
      "utyp": "spbd",
      "type": "unit"
    },
    {
      "name": "百夫长",
      "race": "N",
      "value": 200,
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "火蝠",
      "race": "T",
      "value": 125,
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "先知",
      "race": "P",
      "value": 300,
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "火蝠(精英)",
      "race": "T",
      "value": 300,
      "health": 275,
      "tag": [
        "重甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "烈焰风暴火焰喷射器",
          "damage": "10, vs 轻甲 20",
          "range": 2,
          "speed": 1,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 3,
        "speed": 3.5
      },
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "凤凰",
      "value": 250,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "天霸",
      "value": 600,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "先锋",
      "value": 375,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "黑暗执政官",
      "value": 450,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "零件",
      "value": 0,
      "utyp": "spun",
      "bref": "用于制造",
      "type": "unit",
      "race": "N"
    },
    {
      "name": "精华",
      "value": 0,
      "utyp": "spun",
      "bref": "用于供养和原始异龙消耗",
      "type": "unit",
      "race": "N"
    },
    {
      "name": "原始蟑螂",
      "value": 100,
      "health": 120,
      "tag": [
        "重甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "酸性唾液",
          "damage": 16,
          "range": 4,
          "speed": 1.43,
          "target": "G"
        }
      ],
      "armor": {
        "name": "异虫地面单位甲壳",
        "defense": 0,
        "speed": 4.55
      },
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "不死队",
      "value": 100,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "自动机炮",
      "value": 200,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "修理无人机",
      "value": 0,
      "health": 50,
      "magic": 200,
      "tag": [
        "轻甲",
        "机械单位",
        "英雄单位"
      ],
      "armor": {
        "name": "人类建筑钢板",
        "defense": 0,
        "speed": 2.8
      },
      "type": "unit",
      "race": "N",
      "utyp": "normal",
      "weapon": []
    },
    {
      "name": "原始刺蛇",
      "value": 150,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "原始异龙",
      "value": 250,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "鲜血猎手",
      "value": 125,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "浩劫",
      "value": 200,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "暴掠龙",
      "value": 200,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "亚格卓拉",
      "value": 1000,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "毁灭者",
      "value": 400,
      "health": 150,
      "shield": 100,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "毁灭光束",
          "damage": "6, vs 重甲 10",
          "range": 6,
          "speed": 0.36,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "星灵护板",
        "defense": 0,
        "speed": 3.15
      },
      "type": "unit",
      "race": "N",
      "utyp": "normal",
      "sarmor": {
        "name": "星灵等离子护盾",
        "defense": 0
      }
    },
    {
      "name": "原始点火虫",
      "value": 300,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "原始雷兽",
      "value": 425,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "原始暴龙兽",
      "value": 600,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "马拉什",
      "value": 800,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "混合体毁灭者",
      "value": 500,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "阿拉纳克",
      "value": 1500,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "天罚行者",
      "value": 500,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "德哈卡",
      "value": 750,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "德哈卡分身",
      "value": 300,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "尤尔兰",
      "value": 400,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "武装机器人",
      "value": 1000,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "赛兰迪丝",
      "value": 1000,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "莎拉·凯瑞甘",
      "value": 50,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "刀锋女王",
      "value": 100,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "虚空构造体",
      "value": 3000,
      "type": "unit",
      "race": "N",
      "utyp": "normal"
    },
    {
      "name": "反应堆",
      "value": 0,
      "utyp": "spbd",
      "bref": "每回合结束时, 根据卡牌描述生产指定单位, 金色卡牌可以生产两轮",
      "type": "unit",
      "race": "T"
    },
    {
      "name": "科技实验室",
      "value": 0,
      "utyp": "spbd",
      "bref": "能触发某些卡牌的特殊效果",
      "type": "unit",
      "race": "T"
    },
    {
      "name": "高级科技实验室",
      "value": 0,
      "utyp": "spbd",
      "bref": "此挂件类型无法再被改变\n保留科技实验室效果的基础上, 同时每回合结束时, 触发此卡牌的快速生产",
      "rmrk": "不视为反应堆\n每回合结束时, 不视为挂件变更",
      "type": "unit",
      "race": "T"
    },
    {
      "name": "收割者",
      "value": 100,
      "health": 60,
      "tag": [
        "轻甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "P-45型电磁手枪",
          "damage": 4,
          "multiple": 2,
          "range": 5,
          "speed": 0.79,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 0,
        "speed": 5.25
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "恶蝠",
      "value": 100,
      "health": 135,
      "tag": [
        "轻甲",
        "生物单位",
        "机械单位"
      ],
      "rmrk": "可以变形为恶火",
      "weapon": [
        {
          "name": "凝固汽油喷射器",
          "damage": "18",
          "range": 2,
          "speed": 1.43,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 0,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "恶火",
      "value": 100,
      "health": 90,
      "tag": [
        "轻甲",
        "机械单位"
      ],
      "rmrk": "可以变形为恶蝠",
      "weapon": [
        {
          "name": "地狱火喷射器",
          "damage": "8, vs 轻甲 14",
          "range": 5,
          "speed": 1.79,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 0,
        "speed": 5.95
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "陆战队员",
      "value": 50,
      "health": 45,
      "tag": [
        "轻甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "C-14型电磁枪",
          "damage": 6,
          "range": 5,
          "speed": 0.61,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 0,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "响尾蛇战车",
      "value": 250,
      "health": 200,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "处决者电磁炮",
          "damage": "20, vs 重甲 40",
          "range": 6,
          "speed": 1.43,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 1,
        "speed": 4.13
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "医疗兵",
      "value": 125,
      "health": 60,
      "power": 200,
      "tag": [
        "轻甲",
        "生物单位"
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 1,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal",
      "weapon": []
    },
    {
      "name": "攻城坦克",
      "value": 275,
      "health": 175,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "90毫米口径火炮",
          "damage": "15, vs 重甲 25",
          "range": 7,
          "speed": 0.74,
          "target": "G"
        },
        {
          "name": "穿冲震击炮",
          "damage": "40, vs 重甲 70",
          "range": 13,
          "speed": 2.14,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 1,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "歌利亚",
      "value": 200,
      "health": 150,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "机关炮",
          "damage": 18,
          "range": 6,
          "speed": 1.07,
          "target": "G"
        },
        {
          "name": "地狱火飞弹",
          "damage": "12, vs 重甲 20",
          "multiple": 2,
          "range": 6,
          "speed": 1.07,
          "target": "A"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 1,
        "speed": 3.76
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "寡妇雷",
      "value": 100,
      "health": 90,
      "tag": [
        "轻甲",
        "机械单位"
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 1,
        "speed": 3.94
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal",
      "weapon": []
    },
    {
      "name": "劫掠者",
      "value": 125,
      "health": 125,
      "tag": [
        "重甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "惩罚者榴弹",
          "damage": "10, vs 重甲 20",
          "range": 6,
          "speed": 1.07,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 1,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "医疗运输机",
      "value": 200,
      "health": 150,
      "power": 200,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "rmrk": "自动模式不会使用后燃推进系统",
      "armor": {
        "name": "人类舰船钢板",
        "defense": 1,
        "speed": 3.5
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal",
      "weapon": []
    },
    {
      "name": "秃鹫",
      "value": 75,
      "health": 75,
      "tag": [
        "轻甲",
        "机械单位"
      ],
      "rmrk": "蜘蛛雷伤害70, 但是一直不埋地看不清护甲和血量",
      "weapon": [
        {
          "name": "碎片榴弹",
          "damage": "10, vs 轻甲 25",
          "range": 6,
          "speed": 1.21,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 1,
        "speed": 5.95
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "飓风",
      "value": 250,
      "health": 120,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "台风飞弹舱",
          "damage": 18,
          "range": 5,
          "speed": 0.71,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 1,
        "speed": 4.72
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "铁鸦",
      "value": 300,
      "health": 140,
      "magic": 200,
      "tag": [
        "轻甲",
        "机械单位"
      ],
      "rmrk": "初始能量100, 自动模式不会使用制造自动机炮",
      "armor": {
        "name": "人类舰船钢板",
        "defense": 1,
        "speed": 4.13
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal",
      "weapon": []
    },
    {
      "name": "战狼",
      "value": 300,
      "health": 280,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "轨道枪",
          "damage": 23,
          "range": 6,
          "speed": 0.93,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 1,
        "speed": 3.94
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "维京战机",
      "value": 225,
      "health": 135,
      "tag": [
        "轻甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "格林机关炮",
          "damage": "12, vs 机械单位 20",
          "range": 6,
          "speed": 0.71,
          "target": "G"
        },
        {
          "name": "兰泽尔飞雷",
          "damage": "10, vs 重甲 14",
          "multiple": 2,
          "range": 9,
          "speed": 1.43,
          "target": "A"
        }
      ],
      "armor": {
        "name": "人类舰船钢板",
        "defense": 0,
        "speed": "3.15(机甲模式), 3.85(战机模式)"
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "解放者",
      "value": 300,
      "health": 180,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "列克星敦火箭",
          "damage": 5,
          "multiple": 2,
          "range": 5,
          "speed": 1.29,
          "target": "A"
        },
        {
          "name": "康科德火炮",
          "damage": 75,
          "range": 12,
          "speed": 1.14,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类舰船钢板",
        "defense": 0,
        "speed": "4.72"
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "斯台特曼",
      "value": 200,
      "health": 150,
      "magic": 250,
      "tag": [
        "轻甲",
        "生物单位",
        "英雄单位"
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 1,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal",
      "weapon": []
    },
    {
      "name": "思旺",
      "value": 200,
      "health": 200,
      "tag": [
        "重甲",
        "生物单位",
        "英雄单位"
      ],
      "rmrk": "可以部署热辣贝蒂",
      "weapon": [
        {
          "name": "震荡榴弹",
          "damage": 25,
          "multiple": 1,
          "range": 5,
          "speed": 0.86,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 1,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "热辣贝蒂",
      "value": 0,
      "health": 750,
      "tag": [
        "重甲",
        "机械单位",
        "建筑"
      ],
      "rmrk": "若由思旺召唤, 则持续32秒, 含有召唤标签",
      "weapon": [
        {
          "name": "火焰喷射器",
          "damage": 14,
          "range": 6,
          "speed": 1.43,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类建筑钢板",
        "defense": 1
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "怨灵战机",
      "value": 250,
      "health": 180,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "脉冲激光炮",
          "damage": 13,
          "range": 5,
          "speed": 1.21,
          "target": "G"
        },
        {
          "name": "双子飞弹",
          "damage": "8, vs 重甲 15",
          "multiple": 2,
          "range": 5,
          "speed": 0.89,
          "target": "A"
        }
      ],
      "armor": {
        "name": "人类舰船钢板",
        "defense": 0,
        "speed": 5.25
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "黄昏之翼",
      "value": 275,
      "health": 155,
      "tag": [
        "轻甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "尖啸飞弹",
          "damage": 18,
          "multiple": 2,
          "range": 6,
          "speed": 0.89,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类舰船钢板",
        "defense": 0,
        "speed": 3.85
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "泰凯斯",
      "value": 500,
      "health": 240,
      "tag": [
        "轻甲",
        "生物单位",
        "英雄单位"
      ],
      "weapon": [
        {
          "name": "重机枪",
          "damage": 14,
          "range": 5,
          "speed": 0.18,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 2,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "牛头人陆战队员",
      "value": 550,
      "health": 350,
      "tag": [
        "轻甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "电磁枪",
          "damage": 24,
          "range": 6,
          "speed": 0.61,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 1,
        "speed": 3.29
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "鱼人陆战队员",
      "value": 75,
      "health": 70,
      "tag": [
        "轻甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "C-14电磁枪",
          "damage": 16,
          "range": 6,
          "speed": 0.61,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "未知",
        "defense": 0,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "雷神",
      "value": 500,
      "health": 400,
      "tag": [
        "重甲",
        "机械单位",
        "重型单位"
      ],
      "weapon": [
        {
          "name": "雷神之锤",
          "damage": 30,
          "multiple": 2,
          "range": 7,
          "speed": 0.91,
          "target": "G"
        },
        {
          "name": "250毫米口径惩罚者火炮",
          "damage": "25, vs 重型单位 35",
          "range": 11,
          "speed": 0.91,
          "target": "A"
        },
        {
          "name": "标枪导弹发射筒",
          "damage": "6, vs 轻甲 12",
          "multiple": 4,
          "range": 10,
          "speed": 2.14,
          "target": "A"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 1,
        "speed": 2.62
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "雷诺(指挥官)",
      "value": 800,
      "health": 350,
      "tag": [
        "轻甲",
        "生物单位",
        "英雄单位"
      ],
      "weapon": [
        {
          "name": "电磁枪",
          "damage": "20, vs 重甲 30",
          "range": 8,
          "speed": 0.61,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 2,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "雷诺(狙击手)",
      "value": 650,
      "health": 175,
      "tag": [
        "轻甲",
        "生物单位",
        "英雄单位"
      ],
      "weapon": [
        {
          "name": "突击步枪",
          "damage": 50,
          "range": 9,
          "speed": 1.25,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 0,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "沃菲尔德将军",
      "value": 0,
      "health": 200,
      "tag": [
        "轻甲",
        "生物单位",
        "英雄单位"
      ],
      "weapon": [
        {
          "name": "T-200模块化突击加农炮",
          "damage": 10,
          "range": 6,
          "speed": 0.93,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 1,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "帝盾卫兵",
      "value": 250,
      "health": 200,
      "tag": [
        "重甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "惩罚者榴弹",
          "damage": "20, vs 重甲 40",
          "multiple": 1,
          "range": 7,
          "speed": 0.96,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 1,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "战列巡航舰",
      "value": 700,
      "health": 550,
      "tag": [
        "重甲",
        "机械单位",
        "重型单位"
      ],
      "rmrk": "大和炮冷却21秒, 伤害240",
      "weapon": [
        {
          "name": "空对地激光炮组",
          "damage": 8,
          "range": 6,
          "speed": 0.16,
          "target": "G"
        },
        {
          "name": "空对空激光炮组",
          "damage": 6,
          "range": 6,
          "speed": 0.16,
          "target": "A"
        }
      ],
      "armor": {
        "name": "人类舰船钢板",
        "defense": 3,
        "speed": 2.62
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "陆战队员(精英)",
      "value": 125,
      "health": 90,
      "tag": [
        "轻甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "电磁枪",
          "damage": 12,
          "range": 5,
          "speed": 0.61,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 0,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "劫掠者(精英)",
      "value": 250,
      "health": 250,
      "tag": [
        "重甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "惩罚者榴弹",
          "damage": "12, vs 重甲 30",
          "range": 6,
          "speed": 1.07,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 1,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "歌利亚(精英)",
      "value": 300,
      "health": 200,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "格林机关炮",
          "damage": 24,
          "range": 6,
          "speed": 1.07,
          "target": "G"
        },
        {
          "name": "兰泽尔飞雷",
          "damage": "14, vs 重甲 28",
          "multiple": 2,
          "range": 6,
          "speed": 1.07,
          "target": "A"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 1,
        "speed": 3.76
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "战狼(精英)",
      "value": 450,
      "health": 400,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "龙卷风发射器",
          "damage": 10,
          "multiple": 6,
          "range": 7,
          "speed": 0.93,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 2,
        "speed": 3.94
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "维京战机(精英)",
      "value": 225,
      "health": 180,
      "tag": [
        "轻甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "格林机关炮",
          "damage": 18,
          "range": 6,
          "speed": 0.71,
          "target": "G"
        },
        {
          "name": "兰泽尔飞雷",
          "damage": "14, vs 重甲 20",
          "multiple": 2,
          "range": 9,
          "speed": 1.43,
          "target": "A"
        }
      ],
      "armor": {
        "name": "人类舰船钢板",
        "defense": 0,
        "speed": "3.15(机甲模式), 3.85(战机模式)"
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "攻城坦克(精英)",
      "value": 625,
      "health": 225,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "90毫米口径火炮",
          "damage": "25, vs 重甲 35",
          "range": 7,
          "speed": 0.74,
          "target": "G"
        },
        {
          "name": "弧光震击炮",
          "damage": "60, vs 重甲 100",
          "range": 13,
          "speed": 2.14,
          "target": "G"
        }
      ],
      "armor": {
        "name": "人类战车钢板",
        "defense": 1,
        "speed": 3.15
      },
      "type": "unit",
      "race": "T",
      "utyp": "normal"
    },
    {
      "name": "跳虫",
      "value": 25,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "爆虫",
      "value": 65,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "蟑螂",
      "value": 100,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "破坏者",
      "value": 200,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "刺蛇",
      "value": 150,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "被感染的陆战队员",
      "value": 100,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "异龙",
      "value": 150,
      "health": 120,
      "tag": [
        "轻甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "刃虫",
          "damage": 9,
          "range": 3,
          "speed": 1.09,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "异虫飞行生物甲壳",
        "defense": 0,
        "speed": 5.6
      },
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "雷兽",
      "value": 500,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "虫后",
      "value": 150,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "菌毯肿瘤",
      "value": 0,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "守卫",
      "value": 200,
      "health": 150,
      "tag": [
        "重甲",
        "生物单位"
      ],
      "weapon": [
        {
          "name": "酸性孢子",
          "damage": "20, vs 重甲 30",
          "range": 9,
          "speed": 2.14,
          "target": "G"
        },
        {
          "name": "酸性孢子(对空)",
          "damage": "20, vs 重甲 30",
          "range": 6,
          "speed": 1.43,
          "target": "A"
        }
      ],
      "armor": {
        "name": "异虫飞行生物甲壳",
        "defense": 0,
        "speed": 4.55
      },
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "潜伏者",
      "value": 300,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "感染者",
      "value": 250,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "畸变体",
      "value": 400,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "腐化者",
      "value": 250,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "巢虫领主",
      "value": 500,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "飞蛇",
      "value": 400,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "爆蚊",
      "value": 37,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "莽兽",
      "value": 1000,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "利维坦",
      "value": 2000,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "扎加拉",
      "value": 400,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "斯托科夫",
      "value": 500,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "跳虫(精英)",
      "value": 75,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "爆虫(精英)",
      "value": 150,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "蟑螂(精英)",
      "value": 200,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "破坏者(精英)",
      "value": 400,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "刺蛇(精英)",
      "value": 275,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "异龙(精英)",
      "value": 300,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "雷兽(精英)",
      "value": 700,
      "type": "unit",
      "race": "Z",
      "utyp": "normal"
    },
    {
      "name": "水晶塔",
      "value": 0,
      "utyp": "spbd",
      "bref": "每个为自身卡牌和相邻卡牌提供1能量强度",
      "type": "unit",
      "race": "P"
    },
    {
      "name": "虚空水晶塔",
      "value": 0,
      "utyp": "spbd",
      "bref": "每个为自身卡牌和相邻卡牌提供1能量强度\n卡牌出售时将自身转移给相邻(优先左侧)神族卡牌",
      "type": "unit",
      "race": "P"
    },
    {
      "name": "追猎者",
      "value": 175,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "狂热者",
      "value": 100,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "使徒",
      "value": 150,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "龙骑士",
      "value": 175,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "机械哨兵",
      "value": 150,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "不朽者",
      "value": 375,
      "bref": "不巧者",
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "高阶圣堂武士",
      "value": 200,
      "bref": "战斗中能量消耗完后会尝试融合, 产生的执政官不享受升级",
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "折跃棱镜",
      "value": 250,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "黑暗圣堂武士",
      "value": 250,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "掠夺者",
      "value": 500,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "巨像",
      "value": 500,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "凯拉克斯",
      "value": 600,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "虚空辉光舰",
      "value": 400,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "执政官",
      "value": 450,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "航母",
      "value": 600,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "风暴战舰",
      "value": 425,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "侦察机",
      "value": 250,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "莫汗达尔",
      "value": 600,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "泰坦棱镜",
      "value": 500,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "菲尼克斯",
      "value": 1000,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "旋风狂热者",
      "value": 100,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "科罗拉里昂",
      "value": 1500,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "卡尔达利斯",
      "value": 800,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "仲裁者",
      "value": 1000,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "英雄不朽者",
      "value": 900,
      "bref": "不是不朽者的精英变种",
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "阿塔尼斯",
      "value": 1000,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "激励者",
      "value": 150,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "追猎者(精英)",
      "value": 350,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "狂热者(精英)",
      "value": 200,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "旋风狂热者(精英)",
      "value": 200,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "使徒(精英)",
      "value": 250,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "黑暗圣堂武士(精英)",
      "value": 375,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "巨像(精英)",
      "value": 800,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "虚空辉光舰(精英)",
      "value": 550,
      "health": 250,
      "shield": 150,
      "tag": [
        "重甲",
        "机械单位"
      ],
      "weapon": [
        {
          "name": "棱镜光束",
          "damage": "8, vs 重甲 12",
          "range": 6,
          "speed": 0.36,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "星灵护板",
        "defense": 0,
        "speed": 3.15
      },
      "type": "unit",
      "race": "P",
      "utyp": "normal",
      "sarmor": {
        "name": "星灵等离子护盾",
        "defense": 0
      }
    },
    {
      "name": "执政官(精英)",
      "value": 650,
      "type": "unit",
      "race": "P",
      "utyp": "normal"
    },
    {
      "name": "幽魂",
      "race": "T",
      "value": 275,
      "health": 160,
      "tag": [
        "生物单位",
        "灵能单位"
      ],
      "weapon": [
        {
          "name": "AGR-14型电磁枪",
          "damage": "18, vs 重甲 23",
          "range": 8,
          "speed": 0.71,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "人类步兵护甲",
        "defense": 0,
        "speed": 3.85
      },
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "沃拉尊",
      "race": "N",
      "value": 0,
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "幼雷兽",
      "race": "Z",
      "value": 180,
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "诺娃",
      "race": "T",
      "value": 400,
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "泽拉图",
      "race": "P",
      "value": 1000,
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "混合体巨兽",
      "race": "N",
      "value": 1200,
      "type": "unit",
      "utyp": "normal"
    },
    {
      "name": "岗哨机枪",
      "race": "N",
      "value": 100,
      "health": 125,
      "tag": [
        "重甲",
        "机械单位",
        "建筑"
      ],
      "weapon": [
        {
          "name": "岗哨机枪",
          "damage": 8,
          "range": 6,
          "speed": 0.57,
          "target": "GA"
        }
      ],
      "armor": {
        "name": "人类建筑钢板",
        "defense": 1
      },
      "type": "unit",
      "utyp": "normal"
    }
  ],
  "attr": {
    "$order": [
      "rare",
      "gold",
      "insert",
      "origin",
      "dark",
      "void"
    ],
    "rare": "作为极低概率出现的卡牌",
    "gold": "无法三连",
    "insert": "可以定点部署",
    "origin": "属于原始虫群",
    "dark": "具有黑暗容器",
    "void": "具有虚空投影"
  },
  "upgrade": [
    {
      "name": "献祭",
      "novr": true,
      "cate": "S",
      "desc": "此卡牌的所有单位献祭给卡内价值最高的战斗单位, 获得献祭单位150%生命和护盾值\n新添加的单位同样会献祭",
      "type": "upgrade"
    },
    {
      "name": "轨道空降",
      "novr": true,
      "cate": "S",
      "desc": "战斗阶段, 地图上将出现可移动的空降信标, 此卡牌的所有单位都将在20秒后空降到信标附近(自动模式为10秒)",
      "type": "upgrade"
    },
    {
      "name": "暗影战士",
      "novr": true,
      "cate": "S",
      "desc": "战斗时, 卡牌内的单位获得20秒的隐身, 隐身时无敌, 制造2次伤害则会现形",
      "rmrk": "该升级在三连时不保留",
      "type": "upgrade"
    },
    {
      "name": "反甲",
      "cate": "3",
      "desc": "战斗时卡牌内的单位受伤时, 攻击者受到造成伤害的1/3的反伤",
      "type": "upgrade"
    },
    {
      "name": "力大砖飞",
      "novr": true,
      "cate": "3",
      "desc": "卡牌内所有地面单位变为空中单位, 生命值低于1/3时落地\n巨像除外",
      "rmrk": "飞天单位仍然持有地面状态的碰撞箱, 和真正的空中单位不同\n巨像, 巨像(精英), 天罚行者均不会获得享受升级",
      "type": "upgrade"
    },
    {
      "name": "金光闪闪",
      "cate": "3",
      "desc": "卡牌内所有单位获得20%生命加成和20%伤害加成",
      "type": "upgrade"
    },
    {
      "name": "狙击镜",
      "novr": true,
      "cate": "3",
      "desc": "卡牌内所有单位远程武器攻击距离+2",
      "rmrk": "此升级对如地刺等初始状态下没有远程武器的单位无效",
      "type": "upgrade"
    },
    {
      "name": "重构之壳",
      "novr": true,
      "cate": "3",
      "desc": "卡牌内的单位受到致命伤害后, 避免一次死亡, 并缓慢恢复50点生命值",
      "rmrk": "重生的前几秒不会被敌方选中为攻击目标",
      "type": "upgrade"
    },
    {
      "name": "强化药剂",
      "cate": "T",
      "desc": "卡牌内所有生物单位获得2点生命回复和25%攻速加成",
      "type": "upgrade"
    },
    {
      "name": "合金护甲",
      "cate": "T",
      "desc": "卡牌内所有单位获得20%生命值加成和1护甲",
      "type": "upgrade"
    },
    {
      "name": "火力压制",
      "cate": "T",
      "desc": "卡牌内所有单位获得10%攻速加成, 并且射程+1",
      "type": "upgrade"
    },
    {
      "name": "玻璃大炮",
      "cate": "T",
      "desc": "卡牌内所有单位伤害提高50%, 但生命值和护盾值减少35%",
      "type": "upgrade"
    },
    {
      "name": "重型装甲",
      "cate": "T",
      "desc": "卡牌内所有单位获得35%生命值加成但武器射程-1",
      "type": "upgrade"
    },
    {
      "name": "折跃援军",
      "cate": "P",
      "desc": "一次性效果: 为卡牌添加2个水晶塔, 2狂热者以及2激励者",
      "type": "upgrade"
    },
    {
      "name": "星空加速",
      "novr": true,
      "cate": "P",
      "desc": "卡牌内所有单位时间流逝速度加快15%",
      "type": "upgrade"
    },
    {
      "name": "聚能器",
      "cate": "P",
      "desc": "卡牌内所有单位伤害提高25%",
      "type": "upgrade"
    },
    {
      "name": "虚空水晶",
      "cate": "P",
      "desc": "战斗开始后, 每隔18秒卡牌内的单位攻击速度增加20%, 对光束类武器无效",
      "type": "upgrade"
    },
    {
      "name": "护盾充能",
      "novr": true,
      "cate": "P",
      "desc": "卡牌内所有单位获得25%护盾加成, 同时每有1能量强度, 再获得5点护盾(对建筑无效)",
      "rmrk": "对原先不含护盾的单位有效",
      "type": "upgrade"
    },
    {
      "name": "吞噬",
      "cate": "Z",
      "desc": "杀死敌方单位时吸收其最大生命值50%的血量. 若单位吸收后血量超过最大生命值, 超额部分同时增加血量上限, 每回合重置",
      "rmrk": "单位体积会随血量上限增大而增大",
      "type": "upgrade"
    },
    {
      "name": "狂暴",
      "novr": true,
      "cate": "Z",
      "desc": "战斗开始30秒内, 卡牌内所有单位伤害和移速增加30%",
      "type": "upgrade"
    },
    {
      "name": "深槽脊刺",
      "cate": "Z",
      "desc": "卡牌内所有生物单位伤害降低10%, 生物远程单位获得2点射程加成",
      "type": "upgrade"
    },
    {
      "name": "几丁质甲壳",
      "cate": "Z",
      "desc": "卡牌内所有生物单位获得2点护甲和3生命回复",
      "type": "upgrade"
    },
    {
      "name": "硬化外壳",
      "cate": "Z",
      "desc": "卡牌内所有生物单位最大生命值增加25%",
      "type": "upgrade"
    },
    {
      "name": "黄金矿工",
      "novr": true,
      "cate": "C",
      "desc": "卡牌变为金色, 卡面描述变为\n每回合开始时, 获得1晶体矿\n出售时, 获得3晶体矿",
      "rmrk": "多张黄金矿工卡牌的效果叠加",
      "type": "upgrade"
    },
    {
      "name": "修理无人机",
      "cate": "C",
      "desc": "一次性效果: 给你的卡牌添加n个修理无人机(n=当前酒馆等级+3)",
      "type": "upgrade"
    },
    {
      "name": "内在潜力",
      "cate": "C",
      "desc": "卡牌内所有单位伤害提高50%, 但每秒受到最大生命和护盾值2%的伤害",
      "type": "upgrade"
    },
    {
      "name": "阳光滋润",
      "cate": "C",
      "desc": "卡牌内所有单位每秒受到最大生命和护盾值2%的治疗效果",
      "type": "upgrade"
    },
    {
      "name": "吸血",
      "cate": "C",
      "desc": "卡牌内所有单位攻击伤害造成的20%转化为自身生命值",
      "type": "upgrade"
    },
    {
      "name": "顽强生命力",
      "cate": "C",
      "desc": "卡牌内所有单位生命值+20%",
      "type": "upgrade"
    },
    {
      "name": "毒质变",
      "novr": true,
      "cate": "C",
      "desc": "卡牌内单位造成伤害时, 受伤单位会得到持续5秒, 每秒伤害为最大生命值2%的中毒效果, 中毒效果不叠加",
      "type": "upgrade"
    },
    {
      "name": "电磁加速器",
      "cate": "C",
      "desc": "卡牌内所有单位攻速提高20%",
      "type": "upgrade"
    },
    {
      "name": "灼热打击",
      "cate": "C",
      "desc": "卡牌内所有单位伤害提高20%",
      "type": "upgrade"
    },
    {
      "name": "电磁加速器",
      "cate": "C",
      "desc": "卡牌内所有单位攻速提高20%",
      "type": "upgrade"
    },
    {
      "name": "重力炸弹",
      "novr": true,
      "cate": "C",
      "desc": "此卡牌的单位对空中单位造成伤害时, 会强制其落地3秒",
      "type": "upgrade"
    },
    {
      "name": "刚毅护盾",
      "novr": true,
      "cate": "C",
      "desc": "卡牌内所有单位能将每次受到的伤害减少到1/4最大生命值+护盾值, 但一次最多抵消40伤害",
      "type": "upgrade"
    },
    {
      "name": "缩小光束",
      "cate": "C",
      "desc": "卡牌内所有单位体积减小15%",
      "type": "upgrade"
    },
    {
      "name": "虚空能量",
      "novr": true,
      "cate": "V",
      "desc": "虚空投影加成生命值的同时还会加成相同百分比的伤害",
      "type": "upgrade"
    },
    {
      "name": "原始尖塔",
      "cate": "O",
      "desc": "出售一张中立牌, 此卡牌获得1原始异龙",
      "type": "upgrade"
    },
    {
      "name": "原始甲壳",
      "cate": "O",
      "desc": "卡牌内所有单位生命值+30%",
      "type": "upgrade"
    },
    {
      "name": "原始尖刺",
      "cate": "O",
      "desc": "卡牌内所有单位获得20%伤害加成, 同时远程单位获得1射程加成",
      "type": "upgrade"
    },
    {
      "name": "完美冻结",
      "cate": "S",
      "desc": "此卡牌所有单位的第一次攻击会使目标冻结1秒(被冻结的单位无法移动, 攻击或被攻击)",
      "type": "upgrade"
    }
  ],
  "upgradeCategory": {
    "3": "三连",
    "$order": [
      "S",
      "3",
      "T",
      "P",
      "Z",
      "C",
      "V",
      "O"
    ],
    "S": "特殊",
    "T": "人族",
    "P": "神族",
    "Z": "虫族",
    "C": "公共",
    "V": "虚影",
    "O": "原始"
  },
  "info": {
    "race": [
      "T",
      "P",
      "Z",
      "N",
      "G"
    ],
    "pack": [
      "核心",
      "天空之怒",
      "并肩作战",
      "拉克希尔",
      "短兵相接",
      "快速启动",
      "独辟蹊径",
      "军备竞赛"
    ]
  },
  "tr": {
    "3": "三连",
    "S": "特殊",
    "T": "人族",
    "P": "神族",
    "Z": "虫族",
    "N": "中立",
    "C": "公共",
    "G": "通用",
    "V": "虚影",
    "O": "原始",
    "rare": "稀有",
    "gold": "无法三连",
    "insert": "定点部署",
    "origin": "原始虫群",
    "dark": "黑暗容器",
    "void": "虚影",
    "spbd": "特殊建筑",
    "spun": "特殊单位"
  }
}