function 集结(power, unit, count, wrap) {
  return g => `<集结>(${[power]})：${wrap ? '<折跃>' : '获得'}${count(g)}${unit}`
}

export default [
  {
    name: '折跃援军',
    race: 'P',
    level: 1,
    unit: {
      追猎者: 2,
      狂热者: 2
    },
    desc: [
      g => `<出售>时，<折跃>${g ? 2 : 1}狂热者和${g ? 4 : 2}追猎者`
    ]
  },
  {
    name: '发电站',
    race: 'P',
    level: 1,
    unit: {
      使徒: 4,
      $水晶塔: 1,
      $虚空水晶塔: 1
    },
    desc: []
  },
  {
    name: '供能中心',
    race: 'P',
    level: 2,
    attr: {
      insert: true
    },
    unit: {
      '使徒(精英)': 3,
      追猎者: 2,
      $虚空水晶塔: 1
    },
    desc: [
      g => `提升酒馆等级时，获得${g ? 2 : 1}<水晶塔>`
    ]
  },
  {
    name: '龙骑兵团',
    race: 'P',
    level: 2,
    unit: {
      龙骑士: 5,
      零件: 3,
      $水晶塔: 1
    },
    desc: [
      g => `每回合结束时，获得${g ? 4 : 2}零件`,
      () => `<出售>时，<折跃>n龙骑士(n=零件数量)`
    ]
  },
  {
    name: '万叉奔腾',
    race: 'P',
    level: 2,
    unit: {
      狂热者: 6,
      $水晶塔: 1
    },
    desc: [
      集结(2, '狂热者', g => g ? 2 : 1, false)
    ]
  },
  {
    name: '折跃信标',
    race: 'P',
    level: 2,
    unit: {
      机械哨兵: 4,
      不朽者: 1,
      $水晶塔: 1
    },
    desc: [
      () => '<唯一>：你的<折跃>效果总是添加到这张牌上'
    ],
    remark: '游戏内原文没有唯一，此处根据实际效果添加该标签'
  },
  {
    name: '艾尔之刃',
    race: 'P',
    level: 3,
    attr: {
      insert: true
    },
    unit: {
      狂热者: 6,
      高阶圣堂武士: 2,
      水晶塔: 1
    },
    desc: [
      g => `<进场>时，相邻两侧神族卡牌获得${g ? 2 : 1}<水晶塔>`
    ]
  },
  {
    name: '折跃部署',
    race: 'P',
    level: 3,
    unit: {
      折跃棱镜: 1,
      不朽者: 1,
      狂热者: 4
    },
    desc: [
      g => `每回合结束时，<折跃>${g ? 3 : 2}追猎者`,
      g => `每回合开始时，<折跃>${g ? 2 : 1}狂热者`
    ]
  },
  {
    name: '暗影卫队',
    race: 'P',
    level: 3,
    unit: {
      黑暗圣堂武士: 5,
      $水晶塔: 1
    },
    desc: [
      集结(3, '黑暗圣堂武士', g => g ? 2 : 1, false),
      () => `<能量强度>≥6时，额外获得1黑暗圣堂武士`
    ]
  },
  {
    name: '重回战场',
    race: 'P',
    level: 3,
    unit: {
      不朽者: 3,
      $水晶塔: 2
    },
    desc: [
      g => `<进场>时，所有神族卡牌将${g ? 2 : 1}生物单位变为不朽者`,
      g => `<出售>时，<折跃>${g ? 2 : 1}不朽者`
    ],
    remark: '变不朽的顺序时按照卡牌上的单位从上到下选取\n英雄单位会变为英雄不朽者\n所以快把大主教装罐吧'
  },
  {
    name: '折跃攻势',
    race: 'P',
    level: 4,
    unit: {
      折跃棱镜: 1,
      '追猎者(精英)': 4,
      $水晶塔: 2
    },
    desc: [
      g => `任意卡牌<折跃>时，获得${g ? 2 : 1}追猎者`
    ],
    remark: '养鸡场'
  },
  {
    name: '净化者军团',
    race: 'P',
    level: 4,
    unit: {
      '狂热者(精英)': 3,
      掠夺者: 2,
      $水晶塔: 2
    },
    desc: [
      g => `<集结>(5)：所有神族卡牌将${g ? 2 : 1}地面非重型单位<精英化>，并一同<折跃>他们`
    ],
    remark: '此卡牌可以<精英化>神族卡牌中的非神族单位，如通过<虚空援军>添加的攻城坦克\n卡面描述中的一同<折跃>，是指对于<三连>的净化者军团，每张神族卡牌被<精英化>的两个单位一起<折跃>'
  },
  {
    name: '凯拉克斯',
    race: 'P',
    level: 4,
    unit: {
      凯拉克斯: 1,
      巨像: 1,
      $虚空水晶塔: 1
    },
    desc: [
      g => `每回合结束时，随机<折跃>${g ? 2 : 1}个不朽者/掠夺者/巨像`
    ]
  },
  {
    name: '虚空舰队',
    race: 'P',
    level: 4,
    unit: {
      虚空辉光舰: 4,
      $虚空水晶塔: 1
    },
    desc: [
      集结(5, '虚空辉光舰', g => g ? 2 : 1, true)
    ]
  },
  {
    name: '势不可挡',
    race: 'P',
    level: 4,
    unit: {
      执政官: 4,
      $水晶塔: 2
    },
    desc: [
      () => `<进场>时，<折跃>1执政官(精英)`,
      集结(5, '执政官', g => g ? 2 : 1, true),
      () => `若<能量强度>≥15，额外<折跃>1执政官(精英)`
    ]
  },
  {
    name: '黄金舰队',
    race: 'P',
    level: 5,
    unit: {
      航母: 2,
      风暴战舰: 1,
      $水晶塔: 1,
      $虚空水晶塔: 1
    },
    desc: [
      集结(5, '侦查机', g => g ? 2 : 1, false),
      集结(7, '风暴战舰', g => g ? 2 : 1, false)
    ]
  },
  {
    name: '莫汗达尔',
    race: 'P',
    level: 5,
    unit: {
      莫汗达尔: 1
    },
    desc: [
      g => `<唯一>：任意卡牌<折跃>时，复制<折跃>的最后${g ? 2 : 1}个单位到此卡牌`
    ]
  },
  {
    name: '光复艾尔',
    race: 'P',
    level: 5,
    unit: {
      泰坦棱镜: 1
    },
    desc: [
      () => '获得升级时，展开泰坦棱镜',
      g => `<唯一>：泰坦棱镜展开时，获得<出售>的神族卡牌的${g ? '' : '非英雄'}单位和<水晶塔>(不包括<虚空水晶塔>)，同时收起`
    ],
    remark: '游戏内原文没有唯一，此处根据实际效果添加该标签'
  },
  {
    name: '菲尼克斯',
    race: 'P',
    level: 5,
    attr: {
      insert: true
    },
    unit: {
      菲尼克斯: 1,
      '旋风狂热者(精英)': 3,
      掠夺者: 1
    },
    desc: [
      () => `<进场>时，将两侧卡牌的狂热者和使徒替换为旋风狂热者`,
      集结(5, '掠夺者', g => g ? 2 : 1, false)
    ],
    remark: '游戏内原文为 尝试将两侧……，此处由于其没有实际意义删除\n两侧卡牌中的狂热者(精英)和使徒(精英)会被替换为旋风狂热者(精英)'
  },
  {
    name: '酒馆后勤处',
    race: 'P',
    level: 6,
    unit: {
      科罗拉里昂: 1,
      卡尔达利斯: 1
    },
    banner: '酒馆教学视频：bilibili酒馆后勤处\n作为极低概率出现的卡牌',
    desc: [
      () => '我们需要集结更多观众！',
      () => '<进场>时，所有神族卡牌无条件触发2次<集结>效果'
    ],
    remark: '这张稀有卡牌三连不改变属性\n后勤处真的还在更新吗（\n土子哥，你还有很多视频没有做，还不能休息哦~'
  },
  {
    name: '净化一切',
    race: 'P',
    level: 6,
    unit: {
      '巨像(精英)': 2,
      $水晶塔: 3
    },
    desc: [
      集结(4, '狂热者(精英)', g => g ? 2 : 1, true),
      g => `当<能量强度>≥7时，额外<折跃>${g ? 2 : 1}巨像(精英)`
    ],
    remark: '<折跃>巨像(精英)不是<集结>词条，不会因为14<能量强度><折跃>两次'
  },
  {
    name: '阿尔达瑞斯',
    race: 'P',
    level: 6,
    unit: {
      仲裁者: 1
    },
    desc: [
      g => `<唯一>：每回合结束时，若拥有至少5张神族卡牌，则获得${g ? 2 : 1}英雄不朽者`
    ],
    remark: '指定决赛牌'
  },
  {
    name: '阿塔尼斯',
    race: 'P',
    level: 6,
    unit: {
      阿塔尼斯: 1,
      掠夺者: 2,
      $虚空水晶塔: 1
    },
    desc: [
      g => `每回合结束时，获得2旋风狂热者(精英)${g ? '和2阿塔尼斯' : ''}`,
      () => `<唯一>：你的所有<集结>卡牌每回合无条件额外<集结>一次`
    ],
    remark: '我得重新集结部队\n由于大主教是卡牌的第一个单位，因此你总是可以用<重回战场>把大主教装罐'
  }
]
